[
  {
    "id": "support.papayaglobal.com#1",
    "html_url": "https://support.papayaglobal.com/s/article/bamboohr-api-integration",
    "title": "BambooHR API Integration",
    "body": " \nPapaya API Integration with BambooHR\n \n1. What is the integration? \nPapaya Global’s API integration with BambooHR allows users to sync payroll employee HR and PTO data from BambooHR to Papaya global. \nThe integration supports both HR and PTO data; users may choose whether to integrate only HR data or both HR and PTO data.\nHR Data SyncPTO Sync\nNew projects will be added to the daily HR data sync\nHR Data from BambooHR to Papaya Global will sync daily\n \nThe daily data sync only retrieves HR Data for current onboarded projects\nPTO data sync will run on the Salary Cutoff dateThe first PTO sync will retrieve data for the preceding 3 monthsData that already exists in the Papaya platform will be skipped in the sync processPTO records with future dates will not be syncedOnly PTO records with an \"Approved\" status will be synced\n \n2. Configuring BambooHR for API Integration\nBefore configuring a BambooHR API integration in Papaya Global, set up BambooHR:\nChoose an Identifier Field for Papaya EmployeesConfigure mandatory employee Location fieldCreate a Custom Access Level in BambooHRAssign the custom level to a dedicated Papaya userPopulate mandatory fields in BambooHR for Papaya Global employees\n2.1 Choose an Identifier Field for Papaya Employees\nThe data synchronization process requires that the Papaya platform identify which BabmooHR employees are Papaya Payroll employees. Use one of the following fields to identify Papaya Employees in the system:\n \nLocationDivisionDepartmentEmployment StatusJob Title\n \nFollowing configuration, populate this field for all current and new employees using parameters that will enable you to identify Papaya emolyees. The field must be mandatory for new Papaya employees.\n2.2 Create a Custom Field to Map to Papaya Global's projects\nA custom field is required for Papaya to associate employees with their projects.A project in Papaya consists of 4 attributes:\nSite Location – CountryEmployee Service Type – Payroll, Contractor or EORPay Cycle – Monthly, Weekly, Semi-Monthly, Bi-WeeklyCurrency – USD/EUR/GBP…\ne.g., Pragma Project 1 – Italy, Payroll, Monthly, EURPragma Project 2 – UK, Payroll, Monthly, GBPThe custom field can be a pay group id, pay group name, legal entity ID or name, but it must reflect a 1:1 association to a project in Papaya.In the initial setup of the integration, we will map your employees to the associated projects.\n2.3 Create a Custom Access Level in BambooHR\nTo support the Papaya Global integration, you need to create a custom Access Level for your BambooHR user, by taking the following steps:\n \nLog into BambooHR with an Administrator level user. Select Settings> Access Levels, then click on the Customize icon, and choose Custom Access Level.The Custom Level Access dialog will open. In the Basic Info tab, enter the access level name and click Next Step.Skip the What this Access Level Can Do step by clicking Next Step In the What this Access Level Can See tab – click All Employees, and select Only Some Employees from the drop-down menu.The Filter Options dialog will open. User the unique field you selected to choose only Papaya Payroll employees, then click Save.The What This Access Level Can See tab will open once again. Scroll down the page to view the Employee Data Filter viewing options:Click on each of the Employee Data Filter tabs (Personal, Job, Time Off, Documents,  Benefits, Training, Assets, and Emergency), and select View Only access.After configuring View Only permissions in all the data filter tabs, scroll down the page, and click Save & Finish.\n2.4 Create a Dedicated Papaya User in BambooHR\nAfter configuring the custom field and access level:\nLog into BambooHR as an Administrator.Create a Non-Employee user.Assign the Papaya custom access level to this user.\nThe dedicated user must have a valid email.\n2.5 Populate Mandatory Fields in BambooHR\nTo enable BambooHR to communicate with Papaya Global and integrate HR and PTO data, some fields in BambooHR must be populated for every Papaya Global employee in BambooHR.\n \nThe following tables specify which fields are relevant to the Papaya Global integration, and which are mandatory and must be populated.\n \nIn addition to the following, you must ensure that BambooHR has a field that uniquely identifies Papaya Payroll employees, and a location field that supports the format required by Papaya Global.\n \nEmployee Basic Information Fields:\n \nEmployee Contact Details Fields:\n \nEmployee Employment Status Fields:\n \nEmployee Job Information Fields:\n \nEmployee Compensation Fields:\n \nEmployee PTO Data Fields:\n3. Configuring Integration in Papaya Global\nAfter configuring BambooHR for API integration with Papaya Global, you can proceed to configure the integration on the Papaya Global Integration Center. For a detailed explanation on accessing the Papaya Global Integration Center, click here .\nNote: Only these users can access, view, and use the Integration Center (IC): Customer Admin, Customer HR Manager, Customer Read Only User, users with Org Level Access.\nTo configure a BambooHR API  integration take the following steps:\nLog out of BambooHRSelect integration & integration typeConnect to BambooHRApply mapping schemaConfigure Auto-sync settingsView integration status\n3.1 Log out of BambooHR\nTo prevent SSO issues, log out of BambooHR prior to logging into Papaya to initiate the integration process.\n3.2 Select Integration & Integration Type\nTo initiate the BambooHR API integration and begin the configuration process, click on BambooHR Application  in the Integration Center home page:\n \n \nThe Integration Details page will open, prompting you to select an integration type - HR or PTO. Click the Connect to BambooHR button next to the integration you wish to implement: HR or PTO\n \nNote: Click on the more details links in the integration dialog for information on mandatory fields, required custom field configuration, and more.\n3.3 Connect to BambooHR\nThe Subdomain dialog will open. Enter your BambooHR subdomain, then click Connect & Continue:\n \nNote: The subdomain is the first part of your BambooHR domain. If your domain is https://companyname.bamboohr.com your subdomain is companyname.\nYou will be prompted to login to BambooHR. Click Login with Email and Password, and use the login credentials of the dedicated BambooHR user you created:\n \n \nYou may be prompted to confirm that your browser is trusted. This is a one-time confirmation request. Click Yes, Trust this Browser:\n \n3.4 Apply Field Mapping Schema\nThe application enables you to map source data from your BambooHr system to target Papaya Global fields. You can create any number of schemas, and apply them to additional connections. \n \nThis section explains how to apply an existing schema as-is. For detailed instructions on configuring, editing, and managing mapping schemas, click here.\nFollowing connection to BambooHR, the Field Mapping page will open, displaying the default mapping schema:\n \n \nClick the arrow next to the Mapping Names field and select schema from drop-down list:\n \n \nClick Change to approve application of selected schema:\n \n \nThe selected schema will be applied. Click Connect & Continue:\n \n3.5 Configure Auto-Sync Settings\nOnce fields have been mapped and a connection established, configure Auto-Sync settings:\n \nAuto SyncHR DataPTO DataEnabled\nHR data will be automatically synced every day.\nNew projects will be automatically added to the auto-sync. \nAuto-sync will attempt to sync all Papaya workers; some updates may fail due to validation/other issues.\nData will be automatically updated on the same date as the Salary Update to ensure it pulls all approved requests for the next payroll cutoff.DisabledYou will be directed to contact your dedicated CSM to implement manual synchronization to update HR data.You will be directed to contact your dedicated CSM to implement manual synchronization to update PTO data.\nAfter setting Auto-Sync, click the Complete Integration button:\n \n \n3.6 View Integration Status\nOnce you have completed configuring a PTO/HR integration, the integration center main page and the BambooHR integration dialog will provide the relvant indication:\n \n \n4. Managing Mapping Schemas\n4.1 Default Schema\nFollowing connection to BambooHR, the Field Mapping page will open, displaying the default HR or PTO data mapping from the BambooHR source fields to Papaya Global target fields:\n \nThe default schema cannot be deleted or edited. There is no delete option for the schema, and any edits made to mapping while the default schema is applied can only be saved under a new name.\n4.2 General Actions\n4.2.1 Enabling Schema Editing\nTo enable schema editing, select and apply a schema from the schema drop-down, then confirm change. The schema will open in view mode. Click Edit Mapping to enter edit mode:\n \nOR open schema drop-down, and click the edit icon next to the schema you want to edit. You will be asked to confirm schema change, then the schema will open in edit mode:\n \n \nThe default schema does not have an edit icon, as it cannot be changed. \n4.2.2 Deleting Schemas\nTo delete a schema, open the schema drop-down list, click the Delete icon next to the schema you want to delete, and confirm action:\n \n \nThe default schema does not have a delete edit icon, as it cannot be deleted.\n4.2.3 Creating New Schemas\nNew schemas are created by applying changes to an existing schema, then saving the changed map under a new name.\n \nTo create a new schema, enable editing to the schema you want to use as a base, apply changes to mapping fields, then enter a unique name in the Mapping Name field:\n \n \nSave the new schema:\nIf your base schema was the default map, click Save as New\nIf you selected another base schema, click the Save button arrow, then select Save as New:\n \nIf any of the mandatory fields are not mapped, the Save action will be disabled, and a tooltip will indicate the issue:\n \n4.2.4 Saving Changes to Schema\nChanges can be made to all schemas except the default map. If you apply changes to the default map, you can either save it as a new schema or discard the changes.\n \nTo apply changes to a schema, enable editing to the schema you want to edit, apply changes to mapping fields, then click the Save button:\n \nIf any of the mandatory fields are not mapped, the Save action will be disabled, and a tooltip will indicate the issue:\n \n4.3 Editing Mapping\n4.3.1 Editing Source/Target Fields\nEnable editing for the schema you want to use as base for the new schema, then click on relevant tab to view current mapping schema:\n \n \nFields can only be mapped once. To change mapping of target fields (e.g map BambooHR Preferred Name field to Papaya First Name field) you must first disconnect existing mapping by selecting Do Not Map this Field - then configure the new connection:\n \n \n \n4.3.2 Adding Custom Fields\nCustom fields can only be added when configuring HR data integration\nEnable editing for the schema where you want to add a custom field, open Custom Fields tab, then click Add Field:\n \n \nMap custom field/s to Papaya target fields:\n \n4.3.3 Field Transformation - Split\nTo apply the Split transformation to source data, enable editing to the schema, navigate to the field you wish to configure, then click the transformation icon next to the relevant field:\n \n \nIn the field transformation dialog, select split transformation type, then choose delimiter:\nClick Split Fields, then map source field to target fields. System default is two (2) target fields. use the Add Field button to configure additional target fields for the split data:\nClick Apply to save configuration. The main mapping page will show a transformation indicator (green check-mark) next to the relevant field:\nTo remove the transformation, click on the transformation icon to open the transformation dialog, then click Remove Transformation:\nAfter a transformation is removed, the field will be unmapped:4.3.4 Field Transformation - Lookup\nTo apply the Lookup transformation to source data, enable editing to the schema, navigate to the field you wish to configure, then click the transformation icon next to the relevant field:\nIn the field transformation dialog, select Lookup transformation type, then choose lookup table:\nIn the field transformation dialog, select Lookup, then choose the lookup table. Use the Add New link to configure a new lookup table:\nClick Apply to save configuration. The main mapping page will show a transformation indicator (green check-mark) next to the relevant field:\nTo remove the transformation, click on the transformation icon to open the transformation dialog, then click Remove Transformation:\nAfter a transformation is removed, the field will be unmapped:\n5.  Managing BambooHR Integrations\n5.1  Active/Draft Integrations\nIf you exit the integration wizard prior to completing integration by any means - closing the browser window, opening another Papaya page, etc. - your integration will be saved in Draft status, allowing you to complete the configuration process at any time: Draft integrations are indicated in orange, and active integrations in green.\n5.2  Editing an Active Integration (Delete/Auto-Sync)\nYou can only disconnect or change Auto-Sync settings in an active integration.\nTo edit integrations, access the integration centre as explained above, then set the Integrations toggle to My Integrations to display configured integrations.\nMy Integrations page displays Active Integrations (i.e. integrations that have been fully configured and are operational) and Draft Integrations (i.e. integrations that have been partially configured and are not yet operational).\nClick on an active integration to open the integration dialog for editing:\nClick on the context menu to Disconnect the connection, or Disable/Enable Auto-Sync:\n5.3  Completing a Draft Integration\nTo complete a draft integration, access the integration centre , then set the Integrations toggle to My Integrations to display configured integrations.My Integrations page displays Active Integrations (i.e. integrations that have been fully configured and are operational) and Draft Integrations (i.e. integrations that have been partially configured and are not yet operational).Click on a draft integration to complete to open the integration dialog, then click Complete Setup to return to the step in which you closed the integration wizard:\nTo configure custom fields integration, click Edit Mapping, then click the Custom Fields tab:\n",
    "strictMatch": true
  },
  {
    "id": "support.papayaglobal.com#2",
    "html_url": "https://support.papayaglobal.com/s/article/expensify-integration",
    "title": "Expensify Integration",
    "body": "\nBefore continuing, please ensure you have reviewed the Integration Center Support Guide, here.\nExpensify Onboarding Process\nThe following table breaks down the steps required to implement Expensify data integration:\n \nExpense Category Note:\nWhere a breakdown of different types of expenses is required for taxation purposes (mileage, per-diem, phone etc.) the expense policy defined on Expensify must utilize the relevant expense categories.\nCurrency Note:\nTypically, Papaya retrieves expenses in a single currency for each project.The currency will usually be identical to the Papaya project payment currency. A different currency can be configured via Papaya Support.If an employee reports in multiple currencies, conversion must be implemented in Expensify (exchange rate + expense date), so that the reported expense payment retrieved by Papaya will be in the employee’s payment currency.\nThe following flowchart illustrates the integration process:\n \nOngoing Implementation\nThe following table breaks down the steps comprising ongoing Expensify data sync with Papaya Global:\n \nNote: Manual expense updates in Papaya are blocked for projects that are synced with Expensify to avoid data regression.\n",
    "strictMatch": true
  },
  {
    "id": "support.papayaglobal.com#3",
    "html_url": "https://support.papayaglobal.com/s/article/HCM-Cloud-Connector",
    "title": "HCM Cloud Connector Setup",
    "body": "Papaya Global's HCM cloud connector provides a file mapping tool that allows you to upload one or more Excel or CSV file templates.The mapping wizard aligns and transforms uploaded data to meet the fields of the platform.More information about the file upload security can be found here .To use the data sync option you must go through these 3 steps:\nPrerequisitesApprove the MappingCreate an SFTP folder for future uploads\n \nPPPPrerequisites\nPreparing Your Data for Integration \nKey Data Requirements: \nEnsure source files from the customer meet format criteria: Excel (.xlsx) or CSV (.csv), and UTF-8 encoding. \nIn an Excel (.xlsx) file, the table must start in column A.In a  CSV (.csv) file, the sheet can contain only the table with the data and no additional unrelated data. \nData Organization - the data can be organized in two formats:\nColumns - each worker can appear only once in the file and each data field should be in a separate column. NEW - Multi-row in an Excel file (.xlsx) - each worker can appear multiple times in the file, one column can have different types of data, when using this option, you must also have a value column for each data type. You can see examples of the multi-row format here.\nFile, Sheet, and Header Consistency: \nFile Name: The name should have no spaces in it. Sheet Name:There are 2 options for sheet selection in case there is more than one sheet in the file. By default, the first sheet in the file will be mapped\nBy order - the sheet can be detected by it's location in the file (e.g., first sheet, second sheet etc.), if you choose this option, the location of the sheet in the file must remain the same. By name - the sheet can be mapped according to name:\nName - the sheet will remain in the same namepartial name - if you choose a word from the sheet name, make sure that this word does not appear in other sheets in the file\nHeader Location: The location of the header row in the file must stay the same. First Row of Data: The position of the first row of data should be consistent across files. Unique Header Column Names: Ensure that each column in the header has a unique name. No two columns should have the same name to avoid confusion and ensure precise data mapping. Exact Match for Header Column Names: The names of the header columns must match exactly with those specified in the template or mapping. This exact match is crucial for the system to correctly identify and process each data field. \nConsistency in Date Format Fields: \nIndividual Column Consistency: Within each column that contains date fields, the date format must be consistent. Ensure that all date entries in a single column follow the same date format. Variability Across Different Fields: It is acceptable for different date fields (i.e., different columns) to have different date formats. However, within each specific column, the format should not vary. Standardize numeric formats across files. Ensure text format is consistent (no emojis or symbols) and avoid merged cells. Consistency in these aspects is essential as any changes may prevent the system from recognizing the file and its corresponding mapping. \nEach file can be created as a mapping in one of two options: A file that enables creation of workers and a file that updates existing workers only.Files that will be used for creation of workers must have the following fields. \nUnique worker ID. First and last names. Hire date. At least one email (work or home).\nFiles that will be used to update data for existing workers:\nUnique worker ID. \nEach worker has a main Worker ID (usually created in your HRIS system), in case you are using another system that generates different IDs, we can store an additional Worker ID on our platform, this enables you to send data directly from that platform with the ID that is used there. \nAdhering to these technical requirements will facilitate a smooth and error-free data integration process. If you have any questions or need assistance in preparing your file, please contact your Papaya Customer Success Manager. \n \nFields \nIn this article you can see which fields are relevant for the Papaya connection, and which are mandatory and must be populated.  \nPPPApprove the mapping\nOnce the file was mapped you can approve the mapping. In the Integrations section go to Integrations and choose Data Imports. Here you can see all the data that was synced, and the Status. If the status is \"Partial\" or \"Upload Failure\". please contact your implementation manager. If the sync's status is \"Successful Upload\", please view the report and inform your implementation manager it is approved.\nPPPCreate an SFTP folder for future uploads\nTo create an automated data sync process, we can set up a connection via SFTP.  \nTo Set up SFTP connection, contact your implementation manager and provide him with a source IP address or a range of addresses, and generate an RSA private and public key from your source environment and send us just the RSA public key. \nYou can get this information from your company’s IT.   Once all the information is provided, your SFTP folder will be created, the credentials will be shared with you. it can also be accessed at any point through the Integrations Settings: \n \n ",
    "strictMatch": true
  },
  {
    "id": "support.papayaglobal.com#4",
    "html_url": "https://support.papayaglobal.com/s/article/HiBob-API-Integration",
    "title": "HiBob API Integration",
    "body": "HiBob API Integration user guide\n1. Papaya Global’s API integration with HiBob allows users to sync HR data including basic salary information and PTO data from HiBob to Papaya.The integration supports both HR and PTO data; users may choose if they want to integrate only one type of data or both.This guide is the out of the box solution.Important Note: In case you need customized fields or Data you wish to integrate but does not exist on HiBob (commission, benefits, and additional variables) you can use our HCM Cloud Connector.\n \nHR Data Sync\nPTO Sync\nWorker service types\nPayroll and Contractors workers\nPayroll, Contractors and EOR workers\nInitial sync\nA full data snapshot for the first sync\nThe first PTO sync will retrieve data for the preceding 3 months\nSync schedule\nData from HiBob to Papaya will be synced daily with delta records only from the last run until today.\nData from HiBob to Papaya will be synced daily with delta records only from the last run until today.Combined cycles (current and future) data will be synced. Future cycles (by themselves) will not be synced.\nWorker status\n\"Active\" and \"Inactive\"  workers\nOnly PTO records with an \"Approved\" status will be synced\nManual sync\nManual sync for troubleshooting with a full data snapshot can be requested from your CSM\nManual sync for troubleshooting with a full data snapshot can be requested from your CSM\n \n2. Prerequisites for the integration setupHiBob requires you to create an API Service User to configure your HiBob integration, this is needed so you do not have to use your personal HiBob account to connect. You can learn more about HiBob API here.2.1. Create a Service user and token\nLog into your HiBob account with the administrator user.From the left menu, please select settings > integrations.Select Automation.Click the Service Users icon.\nEnter a unique name and display name.After adding these mandatory fields, please click 'Save' and the service user's ID and token will be displayed. \nYou can learn more about creating a service user and token here. Important! Please make sure to copy the user token, Once you click done, there will be no way to see it again!2.2. Create a permission groupPermission group allows you to specify what data you want the service user, and subsequently Papaya, to have access to. So, let's follow these steps:\nSettingsFrom the left menu, select Settings --> Roles & PermissionsAdd another group\ni.e., Papaya service user group, this will allow you to find the group easily if you ever want to modify the data Papaya has access to.\nIn Select Who's on the Group, click select and add the Service user previously created in the Add Specific Employees and click Apply.\n \nImportant: The people in Select Who's in this group are those chosen for the permission group you are creating. By adding them to the group you are granting them access to the data you will configure in the next step.2.3. Configure permissions for the permission groupTo be fully operational with HiBob, Papaya needs the Permission group to have access to the permissions below. These can be set under People's Data --> Access Rights:Important: By selecting people by condition you can filter out the employees that should not be pulled by the API. \nMake sure you mark all 23 subcategories in the view selected employees check boxes under the \"People\" section, from \"About\" until \"Work Eligibility\" and in order to get the FULL birthdate you would need EDIT permissions to the personal category\nMake sure you mark the requests subcategory in the view selected employees check boxes under the \"Time off\" section.2.4. Create a Custom Field to Map to Papaya Global's projectsA custom field is required for Papaya to associate employees with their projects.A project in Papaya consists of 4 attributes:\nSite Location – CountryEmployee Service Type – Payroll, Contractor or EORPay Cycle – Monthly, Weekly, Semi-Monthly, Bi-WeeklyCurrency – USD/EUR/GBP…\ne.g., Pragma Project 1 – Italy, Payroll, Monthly, EURPragma Project 2 – UK, Payroll, Monthly, GBPThe custom field can be a pay group id, pay group name, legal entity ID or name, but it must reflect a 1:1 association to a project in Papaya.In the initial setup of the integration, we will map your employees to the associated projects.2.5. Populate Mandatory Fields in HiBobTo enable HiBob to communicate with Papaya and integrate HR and PTO data, some fields in HiBob must be populated for every Papaya Global employee in HiBob.The following tables specify which fields are relevant to the Papaya integration, and which are mandatory and must be populated.Employee Identification fields* Choose the nationality format according to the 4 options that are suggested here.  Employee Contact Details Fields:Employee Employment Status Fields:Employee Job Information Fields:Employee Compensation Fields:Employee PTO Data Fields:2.6. Roles and Permissions on the Papaya Global platformTo access the integration center for setup you must have one of the following roles with all three permissions. Talk with your CSM/GPE to make sure you are entitled to access the integration center.\nPermissionsRolesCustomer AdminCustomer HR ManagerIntegration Center ViewIntegration Center EditIntegration Center HR\n3. Configure Integration in Papaya GlobalAfter configuring HiBob for API integration with Papaya, you can proceed to configure the integration on the Papaya Integration Center. For a detailed explanation on accessing the Papaya Integration Center, click here .Note: Only these users can access, view, and use the Integration Center (IC): Customer Admin, Customer HR Manager, Customer Read Only User, users with Org Level Access.To configure a HiBob API integration take the following steps:\nLog out of HiBob.Select integration & integration type.Connect to HiBobApply mapping schema.Configure Auto-sync settings.View integration status\n3.1. Log out of HiBobTo prevent SSO issues, log out of HiBob prior to logging into Papaya to initiate the integration process.3.2, Select Integration & Integration TypeTo initiate the HiBob API integration and begin the configuration process, click on HiBob Application in the Integration Center home page:The Integration Details page will open, prompting you to select an integration type - HR or PTO. Click the Connect button next to the integration you wish to implement: HR or PTO3.3. Connect to HiBobEnter your HiBob User service ID and Token in the credentials dialog, then click Next.3.4. Apply Field Mapping SchemaThe application enables you to map source data from your HiBob system to target Papaya fields. You can create any number of schemas and apply them to additional connections. This section explains how to apply an existing schema as-is. Following connection to HiBob, the Field Mapping page will open, displaying the default mapping schema:\nClick the arrow next to the Mapping Names field and select schema from the drop-down list.Make sure all lines are correct and have a green check mark, then click Connect & Continue3.5. Configure Auto-Sync SettingsOnce fields have been mapped and a connection established, configure Auto-Sync settings:After setting Auto-Sync, click the Complete Integration button:3.6. View Integration StatusOnce you have completed configuring a PTO/HR integration, the integration center main page and the HiBob integration dialog will provide the relevant indication:3.7. Adding Custom FieldsCustom fields can only be added when configuring HR data integration.Enable editing for the schema where you want to add a custom field, open Custom Fields tab, then click Add Field: Map custom field/s to Papaya target fields:Note: For any additional customization you may contact your CSM for assistance.4. Mapping HiBob Integrations4.1. Active/Draft IntegrationsIf you exit the integration wizard prior to completing integration by any means - closing the browser window, opening another Papaya page, etc. - your integration will be saved in Draft status, allowing you to complete the configuration process at any time:4.2. Editing an Active Integration (Delete/Auto-Sync)You can only disconnect or change Auto-Sync settings in an active integration.To edit integrations, access the integration center as explained above, then set the Integrations toggle to My Integrations to display configured integrations.My Integrations page displays Active Integrations (i.e., integrations that have been fully configured and are operational) and Draft Integrations (i.e., integrations that have been partially configured and are not yet operational).Click on an active integration to open the integration dialog for editing:Click on the context menu to Disconnect the connection, or Disable/Enable Auto-Sync:4.3. Complete a Draft IntegrationTo complete a draft integration, access the integration center, then set the Integrations toggle to My Integrations to display configured integrations.My Integrations page displays Active Integrations (i.e., integrations that have been fully configured and are operational) and Draft Integrations (i.e., integrations that have been partially configured and are not yet operational).Click on a draft integration to complete to open the integration dialog, then click Complete Setup to return to the step in which you closed the integration wizard:\nFAQs\nDoes HiBob integrate with Papaya Global's Payroll system?\nYes, it does. The Papaya Integration Center allows companies to easily synchronize their third-party workforce data to the Papaya Platform. In doing so, users will save time, reduce the risk of errors, manage their data from a single source of record, never enter the same data twice, and ensure that all-important information is included in the Papaya Platform. Papaya’s API integration with HiBob allows users to sync payroll employee HR and PTO data from HiBob to Papaya. The integration supports both HR and PTO data; users may choose whether to integrate only HR or PTO data or both HR and PTO data.\nWhat data can be synchronized between HiBob and Papaya Global\nAnything that is supported by the HiBob API can be extracted, we currently consume HR and PTO data.\nThe list of fields from HiBob which are extracted into Papaya can be found in section 2.5, in this guide and is constantly updating.\nIf you have any special requirements that are not covered reach out to us at integrationsupport@papayaglobal.com\nHow does the integration between HiBob and Papaya Global work?\nThe integration between HiBob and Papaya is An API (Application Programming Interface) integration. It allows HiBob and Papaya to communicate and share data with each other.\nThe API integration enables the synchronization of relevant employee data between HiBob and Papaya. This data may include employee information (names, contact details, job titles, etc.), employment history, compensation details, and more.The API integration involves establishing secure communication channels between HiBob and Papaya platform. This involves using authentication protocols such as Service User ID and API Token to ensure that only authorized systems can access and exchange data.\nTo facilitate the data exchange, HiBob and the Papaya system would have defined a mapping mechanism. This mapping ensures that the data fields in both systems align correctly, allowing seamless and accurate transfer of information.\nAre there any prerequisites or technical requirements for integrating HiBob and Papaya Global\nYes. The list of prerequisites can be found in section 2 in this guide.\nWhat are the key benefits of integrating HiBob with Papaya Global?\nWhen using more than one system it is hard to follow the updates and changes in all your systems. By integrating HiBob with Papaya, you know that all the information you update in HiBob is automatically updated in your Papaya platform. For example, HR staff might update an employee’s email address in HiBob, but this doesn’t update the email address where their payslip is sent, unless you have the integration. \n \nCan employee data be automatically synced between HiBob and Papaya Global?\nYes. The data is automatically synced without the need of manual intervention.\nHow often does the sync occur? \nHR Data from HiBob to Papaya will be synced daily at 7AM GMT +1 with delta records only from the last run until today.             PTO data sync will run on the Salary Cut-off date at 7AM GMT +1 with delta records from the last run until today.\nIs there any additional cost associated with the integration?\nThe out of the box API integration is free.If you have any special requirements that are not covered reach out to us at integrationsupport@papayaglobal.com.\nCan HR managers choose the employees that get synced across to Papaya Global?\nYes, when creating a new permission group you can select people by condition and filter out the employees that should not be synced.\nIs there an option for instant sync?\nIn some cases, for example a new employee has been added in HiBob that needs to have payroll set up asap, this can be done by the Papaya team. Contact your CSM/GPE and request an instant sync.\nIf I update information to the Papaya Global platform, does it sync back to HiBob?\nAt this stage, the integration is a one-way sync only (HiBob to Papaya).\nNeed some help connecting my HiBob account and Papaya?\nWe offer customers onboarding and set up as a part of our services, please reach out to us at integrationsupport@papayaglobal.com, one of our team members will be happy to book a setup session.\nHow do I get started?\nIf you’re interested in having Papaya and HiBob working together, contact your CSM/Global Payroll Expert to discuss the next steps. ",
    "strictMatch": true
  },
  {
    "id": "support.papayaglobal.com#5",
    "html_url": "https://support.papayaglobal.com/s/article/integration-center-guide",
    "title": "Integration Center Guide",
    "body": "\nAbout the Papaya Global Integration Center\nWhat is the Integration Center?\nMany Papaya Global customers have third-party systems managing employee and contractor data that they would like to integrate with the Papaya Platform.\n \nOur Integration Center allows companies to easily synchronize their third-party workforce data to the Papaya Platform. In doing so, users will save time, reduce the risk of errors, manage their data from a single source of record, never enter the same data twice, and ensure that all important information is included in the Papaya Global Platform.\n \nData types that can be integrated into Papaya:\nHR Data\nHR Data: This encompasses personal data such as name, nationality, address, etc., and job-related information like cost center, job description, and other professional details. This comprehensive data set helps create a detailed employee profile, crucial for various HR functions. \nPTO Data: available for API integration (except for Namely). PTO import is limited to the current month only, meaning that the PTO end date cannot extend beyond the payroll period end date. For example, PTO leave from the 27th of April to the 5th of May, needs to be divided into two periods: April 27th to April 30th, and May 1st to May 5th. \nCompensation Data \nCost Plan Data: Focuses on financial aspects such as salary structures, benefits, and fixed compensation elements, vital for accurate payroll management and financial planning. \nVariables (Salary Updates): This includes T&A (Time and Attendance), commissions, bonuses, expenses, etc. These elements represent the dynamic and variable aspects of compensation, essential for adapting to performance metrics and other situational changes in pay. \nSupported Integrations\nThe Papaya Global team is always adding new features and integrations to make your Papaya experience more effective and rewarding.\n \nCurrently supported integrations include:\n \n \nUsing the Papaya Global Integration Center\nAccessing the Integration Center\nOnly Customer Admin users can access, view, and use the Integration Center (IC).\nOnce you have ascertained you have the appropriate permissions, log into your Papaya platform, then click Integrations:\n \nConfiguring New Integrations\nTo configure an integration, select one of the supported integrations, and click on it:\n \n \nYou can also use the Search box to find an integration by name (e.g. BambooHR, Expensify, OKTA, etc.):\n \nConfiguring BambooHR API Integration\nFor detailed instructions on implementing a BambooHR API integration with Papaya Global, please refer to the BambooHR & Papaya Global API Integration User Guide.\nConfiguring File Integration\nFile integration enables users to integrate information from any HRIS provider.\nTo configure an automatic sync of HR  data via file integration, click on the File Integration dialog, then click Contact Support to initiate a File Integration support request with Papaya Global.\n \n \n \nFor more information on the file transfer process, the required file format, etc. click here.\nConfiguring Expensify Integration\nTo configure an automatic sync of employee expenses data via integration with Expensify, click on the Expensify Integration dialog, then click Contact Support to initiate an Expensify Integration support request with Papaya Global.\n \n \nFor more information on the Expensify integration onboarding process, ongoing implementation, etc. click here\nConfiguring SSO Integration\nTo configure an integration of Papaya Global authentication with your SSO provider, click on the relevant SSO Provider dialog (Okta, OneLogin, Google). If you are using another SSO provider, click on the Use Another SSO App? dialog.\n \nOnce the relevant integration dialog opens, click Contact Support to initiate an SSO Integration support request with Papaya Global.\n \nFor more information on the SSO integration process, click here.\n \nManaging Existing Integrations\nViewing & Editing Integrations\nIf you wish to view or edit existing integrations, set the Integrations toggle to My Integrations to display configured and draft-status integrations. \n \nIn the My Integrations page, you will be able to view Active Integrations (i.e. integrations that have been fully configured and are operational) and Inactive Integrations (i.e. integrations that have been partially configured and are not yet operational).\n \nClick on an integration dialog to edit:\n \n \nCompleting a Draft Integration\nIf you close the configuration wizard at any point in the process, the information you have entered will be saved in a Draft status, and the integration will appear in the My Integrations page, in the Inactive Integrations section. You can return to the draft at any point to complete the integration configuration process.\n \nClick on an inactive integration to complete. You will be returned to the step in which you closed the integration wizard, and you will be able to complete and enable the integration:\nDisconnecting an Integration\nIf you wish to disconnect an existing integrations, set the Integrations toggle to My Integrations to display configured and draft-status integrations.\nClick on the integration you wish to disconnect:\n \nBambooHR integration - Click the Disconnect link in the integration dialogSSO integration - Click the Request Disconnection link in the integration dialog to send Papaya Support a disconnection request.Expensify integration - Click the Request Disconnection link in the integration dialog to send Papaya Support a disconnection request.File integration - Click the Request Disconnection link in the integration dialog to send Papaya Support a disconnection request.\n",
    "strictMatch": true
  },
  {
    "id": "support.papayaglobal.com#6",
    "html_url": "https://support.papayaglobal.com/s/article/Namely-API-Integration",
    "title": "Namely API Integration",
    "body": "1. Papaya Global’s Out-of-the-box API Integration with Namely \nPapaya Global’s API integration with Namely allows users to sync HR data including basic salary information from Namely to Papaya.  \n \nThis guide is the out of the box solution. You can also see a video of the process. \nImportant Note: In case you need customized fields or Data you wish to integrate but does not exist on Namely (commission, benefits, and additional variables) you can use our HCM Cloud Connector.\n2. Prerequisites for the integration setup  \nNamely requires you to Log into as an Administrator then click on API from the header dropdown. If you do not get the API link, please contact Namely for further assistance. \n2.1 Create New OAuth Application \nClick on New Application to create a new OAuth Application to connect to Papaya Global. \nFill in the following parameters: \nName: <Your Company Name> e.g., Acme LTD. \nWebsite: <Your Company Website> e.g., https://www.acme.com \nRedirect URI: https://service.papayaglobal.com/api/v1/integrationceter \nThe redirect URI will be provided to you at the Papaya Global Integration Center once you choose the Namely integration setup wizard. Make sure you consume the right redirect URL from the Papaya platform. You will need the following roles and permissions as described here . \n2.2 Get Client Identifier and Client Secret Key \nOnce you submit the new oath application you will receive 2 new parameters to connect your Namely application to Papaya Global platform: \nClient Identifier and Client Secret. \nBased on your client ID Client Secret and Sub Domain, we will be able to automatically generate a code for the API. \ne.g., SJstkWERTPS67zlTd2o9W9bGElpszMwG1PbFKZLGXXyqPPRA3DRzeIkFFFZ8F0Hc \nWith this code we will pull the data from Namely directly to Papaya. \nGet the full instructions from the Namely website - Authentication  \n2.3 Create a Custom Field to Map to Papaya Global’s Projects \nA custom field is required for Papaya to associate employees with their projects.  \nA project in Papaya consists of 4 attributes: \nSite Location – Country \nEmployee Service Type – Payroll, Contractor or EOR \nPay Cycle – Monthly, Weekly, Semi-Monthly, Bi-Weekly \nCurrency – USD/EUR/GBP… \ne.g., Pragma Project 1 – Italy, Payroll, Monthly, EUR \nPragma Project 2 – UK, Payroll, Monthly, GBP \nThe custom field can be a pay group id, pay group name, legal entity ID or name, but it must reflect a 1:1 association to a project in Papaya.  \nIn the initial setup of the integration, we will map your employees to the associated projects.\n \n2.4 Populate Mandatory Fields in Namely \nTo enable Namely to communicate with Papaya and integrate HR data, some fields in Namely must be populated for every Papaya Global employee in Namely. The following tables specify which fields are relevant to the Papaya integration, and which are mandatory and must be populated. \nEmployee Identification Fields: Employee Contact Details Fields: Employee Employment Status Fields: Employee Job Information Fields: Employee Compensation Fields:Employee PTO Data Fields:Namely currently does not support PTO via REST API. There is an option to create a custom PTO report and we can pull it via the API\n2.5 Roles and Permissions on the Papaya Global platform \nTo access the integration center for setup you must have one of the following roles with all three permissions. Talk with your CSM/GPE to make sure you are entitled to access the integration center. \n3. Configuring Integration in Papaya Global \nAfter configuring Namely for API integration with Papaya, you can proceed to configure the integration on the Papaya Integration Center. For a detailed explanation on accessing the Papaya Integration Center, click here . \nNote: Only these users can access, view, and use the Integration Center (IC): Customer Admin, Customer HR Manager, Customer Read Only User, users with Org Level Access.\nTo configure a Namely API integration, take the following steps: \nLog out of Namely. \nSelect integration & integration type. \nConnect to Namely \nApply mapping schema. \nConfigure Auto-sync settings. \nView integration status \n3.1 Log out of Namely \nTo prevent SSO issues, log out of Namely prior to logging into Papaya to initiate the integration process. \n3.2 Select connection & connection Type \nTo initiate the Namely API connection and begin the configuration process, click on Namely Application in the Integration page: \nThe connection details page will open, prompting you to select an integration type - HR. Click the Connect button next to the HR Data \n3.3 Connect to Namely \nCopy the “Redirect URI” to your New OAuth Application at Namely, as described here . \nAfter the creation enter your Namely Client ID, Client Secret and sub domain in the credentials dialog, then click Authorize. \n3.4 API Authorization \nYou will be asked to authorize access to Papaya Global. Click on “Allow” \n3.5 Apply Field Mapping Schema \nThe application enables you to map source data from your Namely system to target Papaya fields. You can create any number of schemas and apply them to additional connections.  \nThis section explains how to apply an existing schema as-is.  \nFollowing connection to Namely, the Field Mapping page will open, displaying the default mapping schema: \nClick the arrow next to the Mapping Names field and select schema from the drop-down list. \nMake sure all lines are correct and have a green check mark, then click Connect & Continue. \n3.6 Configure Auto-Sync Settings \nOnce fields have been mapped and a connection established, configure Auto-Sync settings: \nAfter setting Auto-Sync, click the Complete Integration button and check that you are connected: \n3.7 View Integration Status \nOnce you have completed configuring an HR integration, the integration center main page and the Namely integration dialog will provide the relevant indication:\n3.8 Adding Custom Fields \nCustom fields can only be added when configuring HR data integration. \nEnable editing for the schema where you want to add a custom field, open Custom Fields tab, then click Add Field: \nMap custom field/s to Papaya target fields: Note: For any additional customization you may contact your CSM for assistance. \n5.  Managing Namely connections\n5.1 Active/Draft connections\nIf you exit the connection wizard prior to completing the connection by any means - closing the browser window, opening another Papaya page, etc. - your connection will be saved in Draft status, allowing you to complete the configuration process at any time: \n5.2 Editing an Active Integration (Delete/Auto-Sync) \nYou can only disconnect or change Auto-Sync settings in an active integration. \nTo edit integrations, access the integration center as explained above, then set the Integrations toggle to My Integrations to display configured integrations. \nMy Integrations page displays Active Integrations (i.e., integrations that have been fully configured and are operational) and Draft Integrations (i.e., integrations that have been partially configured and are not yet operational). \nClick on an active connection to open the integration dialog for editing: Click on the context menu to Disconnect the connection, or Disable/Enable Auto-Sync: \n5.3 Completing a Draft connection\nTo complete a draft connection, access the connectors hub, then set the connection toggle to My Integrations to display configured integrations. \nMy Integrations page displays Active connections (i.e., connections that have been fully configured and are operational) and Draft connections (i.e., connections that have been partially configured and are not yet operational). \nClick on a draft connection you want  to complete to open the connection dialog, then click Complete Setup to return to the step in which you closed the connection wizard: \n \n \nIntegration FAQs \nDoes Namely integrate with Papaya Global's payroll system? \nYes, it does. The Papaya Integration Center allows companies to easily synchronize their third-party workforce data to the Papaya Platform. In doing so, users will save time, reduce the risk of errors, manage their data from a single source of record, never enter the same data twice, and ensure that all-important information is included in the Papaya Platform. Papaya’s API integration with Namely allows users to sync payroll employee HR data from Namely to Papaya. \nWhat data can be synchronized between Namely and Papaya Global? \nAnything that is supported by the Namely API can be extracted, we currently consume HR  data. \nThe list of fields from Namely which are extracted into Papaya can be found here , and is constantly updating. \nIf you have any special requirements that are not covered reach out to us at integrationsupport@papayaglobal.com \nHow does the connection between Namely and Papaya Global work? \nThe integration between Namely and Papaya is An API (Application Programming Interface) integration. It allows Namely and Papaya to communicate and share data with each other. \nThe API integration enables the synchronization of relevant employee data between Namely and Papaya. This data may include employee information (names, contact details, job titles, etc.), employment history, compensation details, and more. The API integration involves establishing secure communication channels between Namely and Papaya platform. This involves using authentication protocols such as OAuth API application with client ID and client secret keys to ensure that only authorized systems can access and exchange data. \nTo facilitate the data exchange, Namely and the Papaya system would have defined a mapping mechanism. This mapping ensures that the data fields in both systems align correctly, allowing seamless and accurate transfer of information. \nAre there any prerequisites or technical requirements for integrating Namely and Papaya Global? \nYes. The list of prerequisites can be found here . \nWhat are the key benefits of connecting Namely with Papaya Global? \nWhen using more than one system it is hard to follow the updates and changes in all your systems. By integrating Namely with Papaya, you know that all the information you update in Namely is automatically updated in your Papaya platform. For example, HR staff might update an employee’s email address in Namely, but this doesn’t update the email address where their payslip is sent, unless you have the integration.  \nCan employee data be automatically synced between Namely and Papaya Global? \nYes. The data is automatically synced without the need of manual intervention.  \nHow often does the sync occur? \nHR Data from Namely to Papaya will be synced daily at 7AM GMT +1 with delta records only from the last run until today.  \nIs there any additional cost associated with the connection?  \nThe out of the box API integration is free. \nIf you have any special requirements that are not covered reach out to us at integrationsupport@papayaglobal.com. \nIs there an option for instant sync? \nIn some cases, for example a new employee has been added in Namely that needs to have payroll set up asap, this can be done by the Papaya team. Contact your CSM/GPE and request an instant sync. \nIf I update information to the Papaya Global platform, does it sync back into Namely? \nAt this stage, the integration is a one-way sync only (Namely to Papaya). \nNeed some help connecting my Namely account and Papaya? \nWe offer customers onboarding and set up as a part of our services, please reach out to us at integrationsupport@papayaglobal.com, one of our team members will be happy to book a setup session. \nHow do I get started? \nIf you’re interested in having Papaya and Namely working together, contact your CSM/Global Payroll Expert to discuss the next steps. \n ",
    "strictMatch": true
  },
  {
    "id": "support.papayaglobal.com#7",
    "html_url": "https://support.papayaglobal.com/s/article/Onboard-workers-data",
    "title": "Onboard workers' data",
    "body": "During the onboarding you can easily upload your workers' data to Papaya by using our API integrations or our HCM cloud connector.\nAll the fields in the following table can be uploaded and you can see the required information in each country and more information in our Knowledge Base. \nVisit the Integration section in our Support site to see how to integrate your HRIS with Papaya Global.\nView the logic to understand which workers can be integrated from your HRIS to the Papaya platform. \n \nHR Data\nPersonal Data\nEmployment Information\nTax Information\nLegal and Regulatory Compliance\nHealth and Insurance \nBenefits\nRetirement Benefits\nCost Plan Items\nVariables\nIntegration Logic\n \nHR Data\nPersonal Data\nInformationType MandatoryWorker ID  Text/Number  YesFirst Name  Text  YesMiddle NameText  NoLast Name Text  YesMaiden Name Text  NoPreferred Name  Text  NoAll Previous Surnames Text  NoTitle (Mr. Mrs.) TextNoEmployee Confession TextNoReligion TextNoHighest level of education Text  NoHighest Level of Professional Training Text  NoDisabled Employee TextNoDate of Birth  Date  NoCountry of BirthTextNoBirth Certificate NumberTextNoGender  Value List  NoLocal ID Type  Text  \nYes*\nRequired if an ID number is provided \nID Number  Text/Number  NoNationality  Value List  NoMother Tongue Text  NoPlace of Work Text  NoAddress Line 1 Text/Number  NoAddress Line 2  Text/Number  NoAddress line 3Text/NumberNoAddress: City  Text/Number  NoAddress: State Text  NoAddress: Country  Text  \nYes*\nRequired if any Address data is provided \nAddress: Zip Code Text/Number  NoPhone Number  Number  NoWork Email Text  YesPersonal Email  Text  \nYes*\nNew joiners must provide a personal or work email. \nBank Name  Text/Number   NoBank Code  Text/Number   NoBank Branch Code Text/Number   NoBank Branch Name Text/Number   NoBank Account Name Text/Number   NoBank Account Number  Text/Number   NoBank Account Country  Text/Number   NoBank Identifier Code (BIC)  Text/Number  Text/Number   NoIban  Text/Number   NoMarital Status  Text  NoNom Marital Text  NoPartner's Name and First Name Text  NoPartner's Title (Mr. Mrs) Text  NoPartner's Date of Birth TextNoSpousal Religion TextNoPartner has professional income (yes/no) TextNoProfession of Partner TextNoPartner is Disabled (Yes/No) TextNoChild's Date of Birth (1-10)DateNoChild's First Name (1-10)TextNoChild's Last Name (1-10)TextNoNumber of dependent other personsNumberNoNumber of dependent others persons of which are disabledNumberNoDependent Other Persons TextNoNumber of dependent children NumberNoNumber of dependent children of which are disabled NumberNoDependent Children TextNoPension Scheme 1995 TextNoPGL Student Loan Plan TextNoStudent Loan Deducted YTD TextNoStudent Loan PlanTextNoStudent Loan Start Date TextNoStudent Loan Stop Date TextNoEmergency Contact Address Line TextNoEmergency Contact Email Address TextNoEmergency Contact First Name TextNoEmergency Contact Last Name TextNoEmergency Contact Phone Number TextNoEmergency Contact Relationship TextNo\nEmployment Information\nInformationType MandatoryHire DateDateYesTermination Date DateNoTermination Reason  Value List NoEmployment Status  Value List NoEmployment Status Date DateNoEmployment Seniority Start Date  date  NoJob Title  Text/Number  NoFunction TextNoProfessional Code TextNoProfessional Qualifications TextNoJob Category TextNoJob profile TextNoCommercial Function Status TextNoManagement level TextNoEmployee authorized to legally bind the company? TextNoDivision  Text/Number  NoDepartment TextNoCost Center Code  Text/Number  NoCost Center Description  Text/Number  NoLocation (job)  Value List  NoRegion TextNoPerm Address City (Tax Purpose) TextNoPerm Address Country (Tax Purpose) TextNoPerm Address Line 1 (Tax Purpose) TextNoPerm Address Line 2 (Tax Purpose) TextNoPerm Address State/Province (Tax Purpose) TextNoPerm Address Zip Code (Tax Purpose) TextNoSupervisor First Name  TextNoSupervisor Last Name  TextNoSupervisor First email  TextNo\nLegal Entity\nText/Number  NoHR Region  Text/Number  NoProject ID (Papaya project ID) Text/Number  NoP&L Item Code  Text/Number  NoP&L Item Description  Text/Number  NoP&L Sub Region  Text/Number  NoForm Of Employment  Value List  NoScheduled Weekly Hours  Text/Number  NoNumber of Working Days per Week TextNoAnnual Leave (Number) Number   NoCurrency (of payment)  Value List  \nYes*\nRequired if cost plan or variables are sent in file. Denotes the currency in which the worker is paid. \nFrequency (monthly, weekly, semimonthly, bi-weekly)  Value List   NoSalary Update CommentText/Number  NoScopeTextNoWork patternTextNoTime Reduction DaysTextNoWill Travel AbroadTextNoPlace of Check-inTextNoPassport Country of IssueTextNoPassport Expiration Date TextNoPassport NumberTextNoResident Status TextNo\nTax Information \nInformationType MandatoryTax Identification NumberTextNoATO Tax Averaging Letter Available (Y/N)TextNoATO Tax Exemption Letter Available (Y/N)TextNoATO Tax VariationTextNoATO Tax Variation Letter Available(Y/N)TextNoEmail ATO Annual Payment Summary (Y/N)TextNoExempt From PAYG (Y/N)TextNoSTSL (Y/N)TextNoTax AveragingTextNoTax Scale/Tax StatusTextNoTax Variation End DateTextNoTax Variation RateTextNoTax Variation Start DateTextNoTFN NumberTextNoTFN Supplied (Y/N)TextNoTax Class/FactorTextNoAadhaar Card NumberTextNoExpatriateTextNoPAN NumberTextNoAddress of the Tax OfficeTextNo\nLegal and Regulatory Compliance\nInformationType MandatoryEmployee work under temporary contract in the past?TextNoPrevious EmploymentTextNoDimona-NumberTextNoLimosa-Notification FiledTextNoDeclaration Statement Confirming Accuracy of Provided DataTextNoWork Permit TypeTextNoWork Permit NumberTextNoWork Permit Start DateTextNoWork Permit End DateTextNo\nHealth and Insurance\nInformationType MandatoryInsurance Number (per Social Security Card)TextNoPrivate Health InsuranceTextNoSocial Insurance and Health Insurance DataTextNoSocial Security SchemeTextNoState Health InsurerTextNoA1-Form SubmittedTextNoForeign pension and sickness insurance numberTextNoName and address of foreign SSATextNoESI NumberTextNo\nBenefits \nInformationType MandatoryCommuting OptionsTextNoCompany Car Details (Yes/No)TextNoCompany Car private Use (yes/no)TextNoCar ModelTextNoType of fuelTextNo\nRetirement Benefits \nInformationType MandatoryName of Superannuation FundTextNoSalary Sacrifice (Y/N)TextNoSalary Sacrifice Post Tax %,$TextNoSalary Sacrifice Pre Tax %,$TextNoSMSF (Y/N)TextNoSMSF ABNTextNoSMSF Bank Account NumberTextNoSMSF Bank NameTextNoSMSF BSBTextNoSuper ABN NumberTextNoSuper Fund NameTextNoSuper Member NumberTextNoSuper USI NumberTextNoType of Pension RevenuesTextNoPF Joining DateTextNoPF NumberTextNoPF SchemeTextNoUAN NumberTextNoRight to Retirement or Disability PensionTextNo\n \nCost Plan Items:\nInformationType MandatoryBase Amount  Number YesNumber of instalments/ Frequency - mandatory   Number YesPay Type  TextNoEffective Date  DateNo\n \nVariables Fields*:\nInformationType Mandatory Base Amount  Number Yes\n* Variable items are saved for current open payment period\n \nWorker Integration Logic\nThis section outlines the logic used to determine which workers are integrated from your HRIS into our payroll platform.\nEligibility Criteria - Workers must meet the following criteria to be eligible for integration:\nActive or Recently Terminated Employment Status: Workers with an active employment status or those terminated within the last year are considered for integration.Snapshot Date Relevance: We take a snapshot of the data relevant to the current date. Workers with data types that have future start dates will not be integrated until their effective date is reached.Employment Groups: All employment groups are integrated by default. You can adjust the permissions of the integration to send only specific employment groups.\nEOR (Employer of Record) Workers\nCreation and Cost Plan Updates: We do not enable the creation of EOR workers or the creation and updates to their cost plans.HR Data and Salary Updates: For EOR workers, only the updating of HR data for existing workers and salary updates are enabled.\nExclusion Criteria - Workers that meet any of the following conditions are excluded from integration: \n Termination Date: Workers with a termination date that is in the previous fiscal year, unless they are sent in the first 3 months of the current fiscal year.  Adding Terminated workers to current cycle, needs to be handled by your local payroll team on the papaya platform\nmigrating workers between projects - this use case is not automated in the integration process. local payroll administrator should open a ticket on papaya 360 to accommodate this need. after the migration process will be completed the integration for this worker will continue to update the data.Saving Cost Plan Data in the integration \nCost Plan Data Rules \nSaved with the start date of the current open pay cycle. effective date should be populated in your HRIS if the update is retroactive. if the change is retroactive an automatic comment will appear in the Salary updates file to the ICP.Each cost plan item requires an amount, number of instalments and currency. To close a certain cost plan item please set an end date to the pay component. \nData Requirements for Salaried and Hourly Workers:\nTo ensure accurate payroll processing, it's important to understand the different data requirements for salaried and hourly workers.\nDuring the discovery step of the integration Data mapping, inform Papaya global which of the fields from your HRIS distinguish between salaried and hourly workers.\nSalaried Workers: base amount, frequency, Currency, Annualization factor, effective date. Hourly Workers: Base amount for each hourly rate.\nPlease note: for hourly workers, each cycle, the total number of hours worked at each rate should be integrated to papaya. This can be done by uploading a file from your T&A platform or in the Salary updates section on the Papaya Global platform.",
    "strictMatch": true
  },
  {
    "id": "support.papayaglobal.com#8",
    "html_url": "https://support.papayaglobal.com/s/article/SAP-SuccessFactors-API-Integration",
    "title": "SAP SuccessFactors API Integration",
    "body": "Papaya Global’s API integration with SAP SuccessFactors allows users to sync HR and PTO data including basic salary information from SAP to Papaya. This integration enhances payroll processing accuracy and efficiency by automating data transfer.\n \n \nPrerequisites \nIntegration Overview Authentication and Connection Setup \nData Access and Permission Management \nWorker Integration Logic\nOut of the box fields\nUsing the Integration\nData Imports Page\nUpdates and Maintenance\nFAQ\n \n \n \n \n \n \n \n \n \nPrerequisites \nBefore you start, ensure that you have Administrative Access: Full administrative privileges in both Papaya platform and SAP SuccessFactors. \n \n \n \n \nIntegration Overview \nThe integration process involves connecting Papaya platform with SAP SuccessFactors to synchronize key HR and PTO data fields. This synchronization is crucial for maintaining data consistency and accuracy in payroll processing. \nIntegration Mechanism \nSAML Authentication: Integration begins with Single Sign-On (SSO) authentication using the Security Assertion Markup Language (SAML) protocol. This ensures that the exchange of data is conducted in a secure environment where the identity of the Papaya platform is verified by SAP SuccessFactors. \nAPI Protocol: Once authenticated, the Papaya platform utilizes SAP SuccessFactors' OData REST API for data transmission. The RESTful API design allows for a flexible, lightweight transfer of HR data in a structured format (such as JSON or XML), using standard HTTP methods like GET, POST, PUT, and DELETE. \nSynchronization Options \nScheduled Synchronization: The Papaya platform can be configured to automatically perform data synchronization daily, at regular intervals according to the project’s time zone.  \nManual Synchronization: For immediate data updates, the platform provides an on-demand sync feature. This allows administrators to manually initiate the synchronization process at any time, bypassing the scheduled intervals. \nData Transfer Process \nSecure Connection: SAML-based authentication confirms the identity of the Papaya platform to SAP SuccessFactors, establishing a trusted link. \nData Exchange: Using the OData protocol, the relevant HR and PTO data is exchanged between the systems. The REST API's standard HTTP methods facilitate the creation, reading, updating, or deletion of records as needed. \nConfirmation: After the data exchange, the data is then updated and immediately reflected in the Papaya platform. \n \n \n \n \n \n \nAuthentication and Connection Setup \nGenerate API Credentials: Follow the steps in the SAP SuccessFactors documentation to generate API credentials. SAP Documentation support page. \nConfigure in Papaya Platform: Enter these credentials in the integration settings section of Papaya Platform. \n Starting the Integration Wizard \nAccess the Papaya Platform: Log in and go to the Integrations page and select SAP SuccessFactors under the HRIS section.\nConnect to HR Data Integration: Click the 'Connect' button to launch the integration wizard. \nCertification Data: Copy the certificate in the connection step of the wizard.\nRegistering the Application in SAP SuccessFactors \nNavigate to the \"Manage OAuth2 Client Applications\" page within SAP SuccessFactors click \"Register Client Application\" to open the registration window. \nCertificate and Application Details: Paste the Papaya Certificate into the \"*X.509 Certificate\" field, set your application name and URL, and ensure the designated user has the necessary permissions. \nBinding the User to the API \nPermissions Verification: Ensure the user you bind to the API has comprehensive permissions to access all necessary worker and data information. \nApplication Registration: After entering all required details in SAP SuccessFactors, click \"Register\" to finalize the application registration. \nAPI Key Retrieval: Post-registration, click \"View\" in the resulting table to access and copy the API Key. \nConfiguring Papaya Integration Wizard \nEnter API Key: Return to the Papaya Integration Wizard and paste the copied API Key into the \"API Key\" field. \nComplete Required Fields: Fill in all remaining fields. These details are crucial for the successful integration of SAP SuccessFactors data with Papaya Platform. \nSave and Proceed: Click \"Save and Next\" to finalize the connection setup. This action saves your credentials and allows you to proceed to the next phase of the integration process. \nInitial Data Mapping \nMapping Overview: The mapping step is where you define how data from SAP SuccessFactors will correspond to fields within Papaya Platform. This ensures that the imported data is correctly organized and utilized. More on the mapping step can be found in section 6 of this guide. \nOptional Pause\n: If you're not ready to complete this step, click \"Cancel\" to exit. Your connection setup and credentials will be saved, allowing you to return and complete this step later. \nReview and Testing \nConnection Confirmation: Once the initial mapping is defined, you should see a connection screen indicating that the setup is complete and ready for data synchronization. \nData Synchronization Test: It's recommended to perform a test synchronization to ensure that data flows correctly from SAP SuccessFactors to Papaya Platform without any issues. \nFinal Steps \nAdjustments and Optimization: Based on the test results, you may need to adjust the mapping or connection settings for optimal data transfer. \nIntegration Completion: With the successful test and adjustments made, your integration setup is complete. You're now ready to utilize the seamless data flow between SAP SuccessFactors and Papaya Platform for enhanced HRIS capabilities. \n \n \n \n \nData Access and Permission Management \nFor enhanced data security and compliance with privacy regulations, the Papaya platform allows you to control which worker data is synchronized with SAP SuccessFactors. This is achieved by binding a user to the API connection with permissions tailored to the entities you wish to transfer. \nSetting Up Restricted Access \nCreate a Dedicated Integration User: In SAP SuccessFactors, create a user account specifically for the integration. This account will be used solely for API interactions between SAP SuccessFactors and the Papaya platform. \nAssign Limited Permissions: Assign permissions to this integration user that correspond only to the data entities they need access to. This should include only the relevant employees for payroll processing by Papaya Global.  \nBind the User to the API Connection: Within the integration setup on SAP SuccessFactors, bind this user to the API connection. This ensures that any data requests made through the Papaya platform are carried out under the authority of this user, adhering to the set permissions. \nManaging Permissions \nReview and Update Permissions Regularly: As your organizational structure or roles change, review and update the permissions of the integration user to reflect these changes. This ensures that only relevant data is accessible and synchronized. \nAudit Data Access: Periodically audit the data access logs to ensure that the integration user is only accessing the data within their permission scope. This practice helps maintain the integrity of your data security policies. \nData Synchronization with Restricted Access \nWith the integration user in place and permissions defined, the data synchronization process will only include the worker data that the user is authorized to access. Here’s how it impacts the data flow: \nFiltering Data: When a synchronization request is made, either manually or through a scheduled sync, the API will only retrieve or affect data entities that the integration user has permissions for. \nSecurity Compliance: This method ensures that your integration complies with internal data security policies and external regulatory requirements by only exchanging permitted data. \n \nWorker Integration Logic\nThis section outlines the logic used to determine which workers are integrated from SuccessFactors into our payroll platform. \nEligibility Criteria - Workers must meet the following criteria to be eligible for integration:\nActive or Recently Terminated Employment Status: Workers with an active employment status or those terminated within the last year are considered for integration. \nSnapshot Date Relevance: We take a snapshot of the data relevant to the current date. Workers with data types that have future start dates will not be integrated until their effective date is reached. \nEmployment Groups: All employment groups are integrated by default. Customers can adjust the permissions of the integration to send only specific employment groups if desired. \nEOR (Employer of Record) Workers \nCreation and Cost Plan Updates: We do not enable the creation of EOR workers or the creation and updates to their cost plans.\nHR Data and Salary Updates: For EOR workers, only the updating of HR data for existing workers and salary updates are enabled. \nExclusion Criteria - Workers that meet any of the following conditions are excluded from integration: \n Termination Date: Workers with a termination date that is in the previous fiscal year, unless they are sent in the first 3 months of the current fiscal year. \n  Adding Terminated workers to current cycle, needs to be handled by your local payroll team on the papaya platform\nMigrating workers between projects - this use case is not automated in the integration process. local payroll administrator should open a ticket on papaya 360 to accommodate this need. after the migration process will be completed the integration for this worker will continue to update the data.Saving Cost Plan Data in the integration \nCost Plan Data Rules \nSaved with the start date of the current open pay cycle.  effective date should be populated in SuccessFactors if the update is retroactive. if the change is retroactive an automatic comment will appear in the Salary updates file to the ICP. Each cost plan item requires an amount, number of instalments and currency.  To close a certain cost plan item please set an end date to the pay component.  \nData Requirements for Salaried and Hourly Workers:\nTo ensure accurate payroll processing, it's important to understand the different data requirements for salaried and hourly workers. \nDuring the discovery step of the integration Data mapping, inform Papaya global which of the fields from SuccessFactors that distinguish between salaried and hourly workers. \nSalaried Workers: base amount, frequency, Currency, Annualization factor, effective date. Hourly Workers: Base amount for each hourly rate. \nPlease note: for hourly workers, each cycle, the total number of hours worked at each rate should be integrated to papaya. This can be done by uploading a file from your T&A platform or in the Salary updates section on the Papaya Global platform.  \n \n \nOut of the box fields\nThe following are detailed mappings of some key fields: \nAppendix A – HR Data from SAP SuccessFactors to Papaya Platform.\nAppendix B – PTO Data from SAP SuccessFactors to Papaya Platform.\n \n \n \n \n \nUsing the Integration\nAfter setting up the integration: \nHR Data Management: Sync employee details such as names, IDs, and job titles. The synchronization process can be monitored in the integration dashboard. \nPTO Data Management: Automatically update leave balances and track leave requests in real-time. \n \n \n \n \nData Imports Page\nAfter data synchronization between SAP SuccessFactors and the Papaya platform, it's essential to review the import results to ensure accuracy and completeness of the imported data. \nAccessing Import Results \nNavigate to the Data Imports section under the Integrations tab in the Papaya platform. \nHere, you will find a list of all data import activities, including both HR data and PTO data synchronizations. \nUnderstanding Import Status \nSuccessful Upload: The data was imported without any issues. \nPartial Upload: Some data was imported, but there may be errors or warnings that need attention. \nFailed Upload: The import did not complete, and no data was imported due to errors. \nViewing Detailed Reports \nClick on a specific import entry to view detailed results. \nWithin the detailed view, you'll find sections such as Total Entries, Processed, Invalid Data, and Joiners & Leavers. \nValidating Data \nThe Validate Data area highlights any records with issues such as missing mandatory fields or invalid data. Errors must be addressed for the data to be correctly processed in future imports. \nImport Reports \nFor a comprehensive review, download the full import report by clicking the Download Report File button. \nThe report includes all entries, with detailed information on any data issues encountered during the import. \nSteps to Address Errors \nReview the text error descriptions provided in the report to understand the nature of the issues. \nFor straightforward issues, you can often correct the data directly in SAP SuccessFactors. \nRe-attempt the import after making the necessary corrections to verify that the issues have been resolved. \nWhen to Contact Support \nPapaya Support 360 is available 24/7\nIf the error messages are unclear or you're unable to resolve the issues based on the descriptions provided, reach out to the Papaya support team for assistance.  \nProvide specific details about the errors encountered and any steps you've already taken to try to resolve them. This will help the support team assist you more efficiently. \nFor detailed support and assistance and for all integration-related inquiries\nBest Practices \nRegularly monitor your imports to catch and correct issues promptly. \nKeep your field mappings up to date to prevent discrepancies between systems. \n \n \n \n \nUpdates and Maintenance\nRegularly check for and apply updates to both Papaya Platform and SAP SuccessFactors. \nReview integration reports periodically to identify and address any syncing issues. \n \n \n \n \n \n FAQ\nQ: How can I set up a new connection to SAP SuccessFactors?  \nA: To set up a new connection, click the \"Connect\" button next to the respective HR Data or PTO section. You will be guided through a process to authenticate and establish a new connection with your SAP SuccessFactors account. \nQ: What does the 'Latest Sync' time indicate? \nA: The 'Latest Sync' timestamp shows when the most recent data synchronization occurred between SAP SuccessFactors and our platform. It helps you verify that the data is current. \nQ: Can I manually initiate a data synchronization with SAP SuccessFactors?  \nA: Yes, you can manually trigger a data sync by clicking the \"Sync Now\" option. This is useful if you've updated information in SAP SuccessFactors that you need to reflect immediately in our platform. \nQ: What does the 'Auto Sync' status mean?  \nA: The 'Auto Sync' status indicates whether automatic data synchronization is enabled. If enabled, our platform will update data daily from SAP SuccessFactors without manual intervention. \nQ: What should I do if I want to change the fields that are being synchronized?  \nA: To change the fields, click \"Edit Field Mapping\". From there, you can customize which data fields are mapped and synchronized between the two systems. \nQ: How can I view the current field mappings for my integration?  \nA: You can review the existing field mappings by selecting \"View Mapping\". This will display the current configuration and data mappings between SAP SuccessFactors and our platform. \nQ: Is it possible to disconnect or remove an integration?  \nA: If you need to disconnect or remove an integration, select the \"Delete connection\" option. Be cautious with this action, as it will stop all data synchronization activities for that connection. \nQ: Where can I find more help or support for SAP SuccessFactors integration issues?  \nA: If you encounter any issues or need further assistance with your SAP SuccessFactors integration, please contact our support team by clicking the support link or reaching out through the provided contact options on our platform.  \nQ: Can I disable auto-sync and if so, how?  \nA: Yes, auto-sync can be disabled to stop automatic data updates. You can disable it by selecting \"Disable Auto-Sync\" from the options menu. This will turn off automatic synchronization until you choose to re-enable it. \nQ: Can we add additional Pay components in addition to Base salary to our data mapping?   \nA: Yes. During the data mapping step its possible to customize the mapping and add additional Recurring pay components from SAP SuccessFactors. this can be updated at any time.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n ",
    "strictMatch": true
  }
]