[
  {
    "id": "ironvest-kb.groovehq.com#1",
    "html_url": "https://ironvest-kb.groovehq.com/help/why-am-i-being-charged-for-creating-a-masked-card",
    "title": "Why am I being charged for creating a Masked Card?",
    "body": "If you use a credit card to buy Masked Cards, there will be a fee of $2 per card for all cards under $100. In addition, we’ll pass on a charge of 1.5% of the card value for cards above $100.\nThere are two important things to note about the fees:\nIronVest is NOT making money off these fees. We are simply passing along the fees we get charged, so that we may continue to provide you with Masked Cards.\nWe have added a beta service option to link your bank account to IronVest available for Unlimited and Ultimate users. If you link your bank account, since we don't pay as much in fees, you will be able to continue creating Masked Cards without fees as part of your subscription price as long as you're using your Bank Account to fund the cards.\nWe’re not happy about having to pass on more fees to you – especially when they go to big profitable payment companies – so we’ll continue to look for better ways to process transactions for Masked Cards in the future. In the meantime, the convenience, privacy, and security of Masked Cards will now cost a few extra dollars unless you link your bank account to your account.\nTo link your bank account, make sure you have an Unlimited or Ultimate subscription and visit your Settings page.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#2",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-billing-address-should-i-use-for-the-masked-card",
    "title": "What billing address should I use for the Masked Card? ",
    "body": "In order for the transaction to successfully post, you need to use our address for the Masked Card. It is listed on the Masked Card itself and shown below for your reference: \n228 Park Ave S, Suite 97601 New York, NY, 10003\n \nNote: Please make sure you use your own address for shipping purposes. Otherwise, we will receive the package and we're not able to recover it or have it re-shipped to you. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#3",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-to-enable-biometric-protection-for-your-masked-cards",
    "title": "How to Enable Biometric Protection for Your Masked Cards",
    "body": "To enhance the security of your financial transactions, IronVest offers a feature to protect your masked cards using biometrics. Here's a detailed guide on how to enable this feature:\nStep 1: Activate Masked Cards Masked card feature is only available for certain subscription plan. You may need to upgrade your account if you're not on a qualifying plan. To do this, visit the IronVest web app at ironvest.com/app and click on the \"Upgrade\" button located on the header.\nStep 2: Add a Payment Method Navigate to \"Virtual Cards\" under the Pay app within the IronVest web app. Here, you'll find instructions to add and/or verify a payment method. This added method will serve as the funding source for your masked cards.\nStep 3: Install the IronVest Browser Extension Ensure you have the IronVest browser extension installed on your preferred browser. We currently support Chrome, Firefox, and Edge.\nStep 4: Enable IronVest Biometric Protection Go to the settings on the IronVest web app and locate \"Biometric Protection Settings\". Enable this feature for added security.\nOnce these prerequisites are met, you can proceed to enable the biometric protection settings for your masked cards via the IronVest browser extension. Follow these steps:\nStep 5: Access the Extension Dashboard Click on the IronVest Favicon in the extension toolbar. This action will open the extension mini dashboard.\nStep 6: Navigate to Settings In the mini dashboard, click on the \"Settings Panel\". Then, click \"Settings\" and finally, \"Settings For All Sites\".\nStep 7: Enable Card Biometric Protection Check that the \"Card Biometric Protection\" setting is toggled to ON. If it's not, click on the setting to enable it.\nThat's it! With these steps, you can successfully enhance the security of your masked cards using biometric protection. IronVest is committed to providing you with top-notch security and privacy for your financial transactions. If you have further questions, don't hesitate to reach out to our support team.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#4",
    "html_url": "https://ironvest-kb.groovehq.com/help/cards-notice",
    "title": "The Masked Cards feature is going under construction",
    "body": "Dear IronVest Community,\nWe have some news to share with you regarding one of our most beloved features, Masked Cards. At IronVest, we are continuously working to provide you with the best possible experience, and that means constantly improving our offerings.\nTemporary Service Disruption\nStarting January 20, 2024, we'll be temporarily pausing our Masked Cards feature. We know this might be inconvenient, but please rest assured that this break is for a good cause. We plan to relaunch our services during Summer 2024, with exciting improvements.\nWhy the Pause?\nWe've identified areas in the Masked Card feature that can be enhanced to make it even more flexible, faster, and powerful. To achieve this, we're shifting the product onto modern, state-of-the-art financial technology infrastructure. It's all part of our commitment to delivering top-notch services to you.\nWhat It Means for You\nLast Chance to Generate New Cards: January 20, 2024, will be the final day to create new Masked Cards.\nBalances Deadline: Be sure to use any balances on your existing masked cards or close the cards & get a refund by January 20, 2024, to avoid an automatic refund to your funding source.\nEnhanced Masked Cards: When we relaunch, you'll have the opportunity to enjoy enhanced Masked Cards. You may be asked to provide personal details when setting up these new cards.\nA Token of Appreciation\nAs a token of our gratitude for your patience during this service interruption, we'll be extending premium subscriptions for every active Masked Card user of the feature for an additional 4 months at no cost to you. No action is required on your part – it will be applied automatically.\nFAQ\nQ1: Why are you doing this?\nA1: Your feedback means the world to us, and we've been in constant conversation with our valued customers (that's you!). We understand just how much you love Masked Cards, and we share that enthusiasm. However, we also recognize that there's ample room for improvement – from a better overall experience to adding more features that make your online shopping easier and more secure.\nTo make this vision a reality, we had to make a tough decision: upgrade our underlying infrastructure even though that means pausing for maintenance. This upgrade is essential to build the exceptional product you truly deserve. While this means a brief pause in Masked Cards functionality, it's all part of our commitment to delivering an even more outstanding experience.\nRest assured, this short maintenance period will lead to a relaunched service that brings enhanced functionality and an improved experience. We can't wait to share these exciting changes with you soon!\n \nQ2: How can I get the additional 4 months of premium service? Do I need to do anything?\nA2: You don't need to do anything – we've got you covered! We've automatically extended the renewal date of your license by 4 months. You can verify this in the settings page on the web-app under \"Plan.\" Enjoy the extra premium service on us!\n \nQ3: Can I still use my Open card? For how long could I use my existing card that has a balance?\nA3: You can continue using your open cards until January 20th.\n \nQ4: What happens to open cards after January 20?\nA4: After January 20th, any open cards will be automatically closed, and any remaining balances will be refunded back to their original funding source. Please note that any transactions attempted with these closed cards will be declined.\n \nQ5: Where will the refunded money go?\nA5: The refund will be credited back to the same payment method you used for funding the card.\n \nQ6: How do I know what funding source I used?\nA6: To find out which funding source you used to generate a specific Masked Card, you can refer to the email we sent you when the Masked Card was generated. If you have any difficulty or need further assistance, don't hesitate to reach out to us at support@ironvest.com. We're here to help and can provide you with the information you need.\n \nQ7: How do I know how much open balance I have/how many open cards I have?\nA7: You can easily access this information by visiting your IronVest Pay App on the web or by checking your mobile app's Masked Card page. On the web, you can conveniently sort your cards by balance to see exactly how much you have.\n \nQ8: Are there any steps I need to take in preparation for the maintenance period?\nA8: Yes, to ensure a smooth transition during the maintenance period, we recommend removing your cards from any websites or platforms where you've set up card-on-file information (such as subscription services or e-commerce sites). This step will help prevent declined transactions and any inconvenience during the upgrade. Additionally, we recommend that you close your open cards yourself instead of waiting for the system to do it automatically for you. This proactive approach will give you better control over your accounts during this period.\n \nQ9: What happens to open or pending transactions when the maintenance period begins?\nA9: Approved authorizations as of January 20, 2024, will still settle as they were previously authorized.\n \nQ10: When will the new card product be available?\nA10: We are working diligently to bring you the enhanced card product, and our target is to launch it by the end of Summer 2024. Stay tuned for updates!\n \nQ11: Will I be notified when cards are available again?\nA11: Absolutely! We will notify you by email, and you'll also see notices on the web app, mobile app, and the extension to ensure you stay informed about the availability of cards.\n \nQ12: Will I still be able to receive refunds from the merchant on my Masked Cards after 1/20/2024? How do I recover them?A12: Yes, your Masked Cards will still receive refunds after 01/20/2024. To receive the refund back to your funding source, please contact us at support@ironvest.com\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#5",
    "html_url": "https://ironvest-kb.groovehq.com/help/installing-the-extension",
    "title": "Installing the extension",
    "body": "In order for IronVest to work as expected, you'll need to install the extension to your Browser:\nChrome: click this link.  \nFirefox: click this link\nEdge: click this link\nEven though the extension can work in other browsers with some errors, these are the browsers we officially support. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#6",
    "html_url": "https://ironvest-kb.groovehq.com/help/install-the-app",
    "title": "Install the app",
    "body": "For Android: \nSearch for IronVest on Google Play or click here. \nClick Install\nOnce installed, log in with your email and password for IronVest\nFor iOS\nSearch for IronVest on the AppStore or click here\nClick Install\nOnce installed, log in with your email and password for IronVest\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#7",
    "html_url": "https://ironvest-kb.groovehq.com/help/set-up-the-app",
    "title": "Set up the App",
    "body": "For Android: \nLog in with your email and password for IronVest\nGo to Settings \nClick Enable Autofill and follow the instructions\nAt the time, the Android app will only autofill in Firefox. If you encounter any issues, please contact support.\n \nFor iOS:\nOpen Settings on your phone.\nGo to Passwords & Accounts.\nTap the setting for AutoFill Passwords\nTurn on the switch for AutoFill Passwords\nTap the name for IronVest in the \"Allow Filling From\" section\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#8",
    "html_url": "https://ironvest-kb.groovehq.com/help/where-to-enter-email-authentication-code",
    "title": "Where to enter Email Authentication Code",
    "body": "If you have email authentication enabled on your account, you will see a field where to enter the code after entering your password to log in. \nPlease note that if you're using the extension popup, this field might not show up and you'll need to log in using the Toolbar Icon Menu or the website. \nIf you can't see where to enter the code on the mobile app, make sure to fully log out and re-enter your email and password. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#9",
    "html_url": "https://ironvest-kb.groovehq.com/help/set-up-your-masked-phone-number",
    "title": "Set up your Masked Phone number",
    "body": "If you have a non-US Phone number, please contact support for set-up assistance.\n \nWhen you land on the Dashboard, click the Masked Phone option.\nClick the \"Create\" button on the top right of the screen. \nSelect your country from the drop-down. Please note that Masked Phone is only available in selected countries. To see a list, check out this FAQ. \nEnter your real phone number. \nChoose the option you'd like to use to verify your number and click the Verify My Number button. \n \n \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#10",
    "html_url": "https://ironvest-kb.groovehq.com/help/add-your-credit-or-debit-card",
    "title": "Add your Credit or Debit Card",
    "body": "On your computer: \nOn your Dashboard, Click the Account icon\nClick Settings\nClick Edit or Setup next to Payment Method\nEnter your Card Details and Click Save Card\nOn the app: \nGo to Settings\nClick on the card. \nEnter the details\nClick Continue\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#11",
    "html_url": "https://ironvest-kb.groovehq.com/help/set-up-masked-cards",
    "title": "Set up Masked Cards",
    "body": "On your computer: \nGo to the Masked Card section. \nIf you have not added your Card, add it by following these instructions. \nClick the Verify Card button. \nEnter the verification amount. \nAfter that, you should be able to create a Masked Card by clicking the '+ New Masked Card'. \nOn the app: \nAdd your card information via the Settings section. \nAdd your Billing Address. \nVerify the Card. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#12",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-can-i-enable-two-factor-authentication",
    "title": "How can I enable Two-Factor Authentication?",
    "body": "\nFirst, ensure that you have downloaded a Two-Factor Authentication (2FA) app, like Authy, Google Authenticator, or FreeOTP to your mobile device.\nNavigate to your Settings page: https://ironvest.com/app/settings\nClick 'Account'\nClick 'Enable' next to Two-Factor Authentication \nOpen the Two-Factor Authentication app that is installed on your mobile device.\nUse your mobile device to scan the barcode that is on your Privacy Dashboard screen: https://ironvest.com/app/settings/account/two-factor-auth\nOnce you've scanned the code, a number will be generated in the Two-Factor Authentication app. Enter that number into the website and click Submit.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#13",
    "html_url": "https://ironvest-kb.groovehq.com/help/i-just-signed-up-for-premium-and-am-unable-to-create-masked-cards",
    "title": "I just signed up for premium, and am unable to create Masked Cards.",
    "body": " \nSome of the reasons why your account could have been flagged include, but are not limited to:\nUsing a Prepaid Card as your funding source\nYour Billing Information not passing an AVS Check.\nIncomplete/Failed verification process. \nUse of a VPN\nChanging your funding source multiple times. \nIf you don't think any of these applies to you can contact support@ironvest.com so we can review your account and let you know the reason behind this issue. If any of these apply to you, please make sure to update the information accordingly and make sure to contact support@ironvest.com to have the flag removed. \nDue to the nature of our service, we do have a rather strict security system in place. These security precautions help to keep the bad guys out, but unfortunately, can cause legitimate Masked Card users to be unable to create cards. The odds are you did nothing wrong, but our system read your account as being suspicious for one reason or another.\n \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#14",
    "html_url": "https://ironvest-kb.groovehq.com/help/i-keep-getting-an-error-message-that-i-cannot-create-cards-because-i-am-not-in-the-us-but-i-am-what-does-this-mean",
    "title": "I keep getting an error message that I cannot create cards because I am not in the US, but I am! What does this mean?",
    "body": "If you're receiving this incorrect error message, it most likely means that you are using a VPN. As Masked Cards are for US users only, if you use a VPN, our system may read that you are coming from a location outside of the US, so we will place a lock on the account.\nIn order to get the hold removed, you will need to contact support. Once our support team removes the hold, you will be able to create Masked Cards.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#15",
    "html_url": "https://ironvest-kb.groovehq.com/help/why-am-i-being-charged-for-creating-a-masked-card",
    "title": "Why am I being charged for creating a Masked Card?",
    "body": "If you use a credit card to buy Masked Cards, there will be a fee of $2 per card for all cards under $100. In addition, we’ll pass on a charge of 1.5% of the card value for cards above $100.\nThere are two important things to note about the fees:\nIronVest is NOT making money off these fees. We are simply passing along the fees we get charged, so that we may continue to provide you with Masked Cards.\nWe have added a beta service option to link your bank account to IronVest available for Unlimited and Ultimate users. If you link your bank account, since we don't pay as much in fees, you will be able to continue creating Masked Cards without fees as part of your subscription price as long as you're using your Bank Account to fund the cards.\nWe’re not happy about having to pass on more fees to you – especially when they go to big profitable payment companies – so we’ll continue to look for better ways to process transactions for Masked Cards in the future. In the meantime, the convenience, privacy, and security of Masked Cards will now cost a few extra dollars unless you link your bank account to your account.\nTo link your bank account, make sure you have an Unlimited or Ultimate subscription and visit your Settings page.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#16",
    "html_url": "https://ironvest-kb.groovehq.com/help/is-there-a-limit-to-using-masked-cards",
    "title": "Is there a limit to using Masked Cards?",
    "body": "Yes there is a limit to using Masked Cards. New Masked Card users begin with low spending limits while our automated payments system adjusts to your account and Masked Card usage.\nIf you'd like to inquire about higher limits or would like to know what your limit is, please contact support@ironvest.com and we'll look into your account.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#17",
    "html_url": "https://ironvest-kb.groovehq.com/help/do-masked-cards-work-internationally",
    "title": "Do Masked Cards work internationally?",
    "body": "Unfortunately, we had to block non-US merchants due to heavy fraud concerns. As it turns out, the majority of transactions placed with non-US merchants using Masked Cards have been initiated by fraudulent users. Although certain non-US countries are not of particular concern, we're only able to separate merchants by US and non-US, and are not able to allow specific \"safe\" countries at this time.\nThe plan is to allow non-US merchants again within the near future, but we will not be able to do so until we're confident we won't see the same negative consequences we were seeing previously.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#18",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-billing-address-should-i-use-for-the-masked-card",
    "title": "What billing address should I use for the Masked Card? ",
    "body": "In order for the transaction to successfully post, you need to use our address for the Masked Card. It is listed on the Masked Card itself and shown below for your reference: \n228 Park Ave S, Suite 97601 New York, NY, 10003\n \nNote: Please make sure you use your own address for shipping purposes. Otherwise, we will receive the package and we're not able to recover it or have it re-shipped to you. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#19",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-happens-if-a-merchant-issues-a-refund-to-my-masked-card",
    "title": "What happens if a merchant issues a refund to my Masked Card?",
    "body": "If a merchant refunds a payment made with the Masked Card, the funds will go back to the Masked Card you used for this transaction. If the Masked Card is still open, you can close it and have the balance refunded back to you.\n \nIf the Masked Card is already closed, you would need to contact us at support@ironvest.com and we will issue the refund back to your card on file.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#20",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-to-enable-biometric-protection-for-your-masked-cards",
    "title": "How to Enable Biometric Protection for Your Masked Cards",
    "body": "To enhance the security of your financial transactions, IronVest offers a feature to protect your masked cards using biometrics. Here's a detailed guide on how to enable this feature:\nStep 1: Activate Masked Cards Masked card feature is only available for certain subscription plan. You may need to upgrade your account if you're not on a qualifying plan. To do this, visit the IronVest web app at ironvest.com/app and click on the \"Upgrade\" button located on the header.\nStep 2: Add a Payment Method Navigate to \"Virtual Cards\" under the Pay app within the IronVest web app. Here, you'll find instructions to add and/or verify a payment method. This added method will serve as the funding source for your masked cards.\nStep 3: Install the IronVest Browser Extension Ensure you have the IronVest browser extension installed on your preferred browser. We currently support Chrome, Firefox, and Edge.\nStep 4: Enable IronVest Biometric Protection Go to the settings on the IronVest web app and locate \"Biometric Protection Settings\". Enable this feature for added security.\nOnce these prerequisites are met, you can proceed to enable the biometric protection settings for your masked cards via the IronVest browser extension. Follow these steps:\nStep 5: Access the Extension Dashboard Click on the IronVest Favicon in the extension toolbar. This action will open the extension mini dashboard.\nStep 6: Navigate to Settings In the mini dashboard, click on the \"Settings Panel\". Then, click \"Settings\" and finally, \"Settings For All Sites\".\nStep 7: Enable Card Biometric Protection Check that the \"Card Biometric Protection\" setting is toggled to ON. If it's not, click on the setting to enable it.\nThat's it! With these steps, you can successfully enhance the security of your masked cards using biometric protection. IronVest is committed to providing you with top-notch security and privacy for your financial transactions. If you have further questions, don't hesitate to reach out to our support team.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#21",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-block-a-number",
    "title": "How do I block a number?",
    "body": "\nGo to ironvest.com/app\nClick 'Masked Phone'. \nLook for the number you want to block. \nToggle forwarding off. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#22",
    "html_url": "https://ironvest-kb.groovehq.com/help/why-can-t-i-verify-my-real-phone-number-to-set-up-my-masked-phone",
    "title": "Why can't I verify my real phone number to set up my Masked Phone?",
    "body": "If your real phone number is non-US, your country has some regulations that we need to follow before we can issue a Masked Phone number for you. For more information and for resolution, please write to support at support@ironvest.com\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#23",
    "html_url": "https://ironvest-kb.groovehq.com/help/can-i-receive-text-messages-on-my-masked-phone",
    "title": "Can I receive text messages on my Masked Phone?",
    "body": "At this time only U.S. and U.K. users can receive text messages on their Masked Phone (note that your telephone plan and receiving device must also support text messaging). We are working with our partner to provide texting functionality for other countries.\nPlease note that some US phone carriers will not allow forwarding of \"short-code messages.\" This means that some of the texts used for user authentication by websites like Google and Facebook may not be compatible with Masked Phone numbers at this time. We hope carriers loosen these restrictions in the near future.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#24",
    "html_url": "https://ironvest-kb.groovehq.com/help/can-i-send-text-messages-from-my-masked-phone",
    "title": "Can I send text messages from my Masked Phone?",
    "body": "You can respond to texts sent to your Masked Phone number but you can't initiate a text conversation without revealing your real phone number. \nTo reply to a text sent to your Masked Phone while making sure your real phone number is not disclosed, first type the last four digits of the number that has just texted you, followed by a colon, followed by the message that you want the recipient to receive.\nFor example, if you receive a text from a phone number (123) 456 - 7891, in order to respond with a Masked text message, you would write \"7891: (your message here).\"\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#25",
    "html_url": "https://ironvest-kb.groovehq.com/help/are-there-limits-to-calling-and-texting",
    "title": "Are there limits to calling and texting?",
    "body": "Yes, there are limits in place for the number of minutes and texts you can use per month. With a premium subscription, users are given $3.00 in Masked Phone usage every month. For each masked phone call, it costs $0.01 to connect and $0.01 for each additional minute. Each text received to a Masked phone is also $0.01. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#26",
    "html_url": "https://ironvest-kb.groovehq.com/help/are-masked-phone-numbers-supported-internationally",
    "title": "Are Masked Phone Numbers supported internationally?",
    "body": "Masked Phones are supported in the following countries:\nAustria\nAustralia\nGermany\nBelgium\nCanada\nDenmark\nFinland\nFrance\nIreland\nItaly\nNetherlands\nPoland\nPortugal\nSouth Africa\nSpain\nSweden\nUnited States\nUnited Kingdom\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#27",
    "html_url": "https://ironvest-kb.groovehq.com/help/where-do-i-view-the-codes-if-passcode-protection-is-on",
    "title": "Where do I view my passcodes if Passcode Protection is on? ",
    "body": "You can see the codes on the IronVest app or on the Website.\n \nIf using the website:\nClick on the Passcodes section on the Dashboard:\nIf using the app: \nClick on Masked Phone on the Dashboard.\nClick the icon on the top right:\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#28",
    "html_url": "https://ironvest-kb.groovehq.com/help/can-i-change-my-masked-phone-number",
    "title": "Can I change my Masked Phone number? ",
    "body": "Yes! You can. It costs $7 to change your Masked Phone number.\nNavigate to the Masked Phone section of your Dashboard or simply click here.\nClick \"Change Masked Phone\":\nConfirm that you would like a new number and agree to pay the one-time $7 fee:\nRefresh your page.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#29",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-access-my-accounts-and-passwords-across-multiple-devices",
    "title": "How do I access my accounts and passwords across multiple devices?",
    "body": "If you have Backup and Sync enabled and you're storing your data on our servers, all you need to do to access the information on another device is log in using the login credentials for your IronVest account. Please note that Backup & Sync is a premium feature but all users will receive a free premium trial that includes this feature for 30 days once they sign up. After the 30 days, you will need to upgrade to premium in order to access Backup & Sync.\nWe encrypt all of your information directly with your password and Backup Passphrase before it is sent to the cloud so at no point will IronVest store your plain text account information on our servers.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#30",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-happens-if-i-clear-my-cache-when-i-restart-my-browser",
    "title": "What happens if I clear my cache when I restart my browser?",
    "body": "If you have your information stored locally (i.e. you do not have Backup & Sync authorized), your accounts and passwords can get deleted if you clear your browser cache. DO NOT CLEAR YOUR CACHE, unless you are OK with having your accounts & passwords removed.\nIf you lose your accounts due to a cache reset, the only way to recover this information is if you have a previous export of your data or if the data is available on another device. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#31",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-stop-ironvest-from-filling-erroneous-form-fields",
    "title": "How do I stop IronVest from filling erroneous form fields?",
    "body": "If you ever notice that IronVest is filling a field incorrectly, please contact support@ironvest.com to inform us of which website you are on, and how it is being incorrectly filled. Our team will resolve this as quickly as possible from our end.\nIn the meantime, you can always use the 'right-click' context menu in order to force IronVest to auto-fill the correct information for you. Once you use this feature on a specific form field on one page, IronVest will begin remembering the kind of information that you want auto-filled in that specific form field. You can follow these steps to fill the correct information in the form field:\n1. Right-click into the form field and scroll down to IronVest: \n2. From here, select the appropriate entry.\nFor example, if I wanted to Mask My email, I would right click and scroll to IronVest. Hover over Email and then select Mask My Email\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#32",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-can-i-turn-off-the-password-manager",
    "title": "How can I turn off the Password Manager?",
    "body": "\nClick the IronVest icon on your browser's toolbar\nClick 'Settings Panel'\nClick 'Settings' at the bottom. \nClick 'Settings for All Sites'\nToggle OFF: 'Account Saving', 'Account auto-fill', and 'Suggest strong passwords'\nRefresh the page.\nNote: These features are independent of one another. You can individually turn off Account Saving, Account auto-fill, and Suggest strong passwords depending on what suits you best.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#33",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-export-my-ironvest-data",
    "title": "How do I export my IronVest data?",
    "body": "\nClick the Account icon in the top right-hand corner of the screen\nSelect 'Settings'\nClick 'Data' on the column on the left\nClick 'Export'\nDepending on the file you'd like, select either either Export CSV or Export IronVest Data\nThe CSV file is for importing to another Password Manager or for easier safekeeping of your accounts. \nThe .txt file is to reimport to IronVest. \nSave the file\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#34",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-can-i-import-my-accounts-from-another-password-manager",
    "title": "How can I import my accounts from another password manager?",
    "body": "\nGo to the IronVest Dashboard and click on the Account icon.\nClick Settings\nScroll to the bottom and Click Import\nSelect the product you would like to import from.\nClick Choose CSV File\nFind the exported file and click Open\nMake sure the columns on the IronVest website match the columns on the CSV by using the Dropdown\nClick Import at the top right. \nNote: If you're experiencing any issues, please contact support at support@ironvest.com.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#35",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-can-i-make-ironvest-my-default-password-manager",
    "title": "How can I make IronVest my default password manager?",
    "body": "\nClick the IronVest icon in your browser toolbar.\nLook for the message 'IronVest is not your default Password Manager'.\nClick 'Make Default'.\nClick the Chrome message to allow IronVest access.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#36",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-can-i-disable-ironvest-as-my-default-password-manager",
    "title": "How can I disable IronVest as my default password manager?",
    "body": "\nGo to your Chrome settings:\nOn your computer, open Chrome.\nAt the top right, click More   Settings\nClick 'Autofill'\nSelect 'Passwords'.\nClick 'Disable' next to IronVest.\nRepeat step 4 for 'Payment methods' as well as 'Addresses and more' in your Chrome settings\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#37",
    "html_url": "https://ironvest-kb.groovehq.com/help/creating-a-masked-card",
    "title": "Creating a Masked Card",
    "body": "Using the IronVest Website: \n1. Go to the Virtual Cards section. \n \n2. Click '+ New'\n \n3. Click 'Create New Masked Card' \n \n4. Enter the amount you'd like to create the card for and a label. \n \n5. Click 'Create Card'\n \nWith the extension: \n1. Go to a Checkout Page. \n2. Click the Card Number field. \n3. Click 'Protect My Card'\n \n4. Enter the amount and click 'Finish Up'\n \n5. Click 'Confirm'\nOn the app: \nClick on Masked Cards\nClick '+'\nEnter the label and the amount\nClick 'Create Masked Card'\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#38",
    "html_url": "https://ironvest-kb.groovehq.com/help/make-a-call-from-the-masked-phone",
    "title": "Make a Call from the Masked Phone",
    "body": "Using the website: \nOn the Dashboard, click Masked Phone under the Privacy section\nClick '+ New' and select 'Make a Masked Call\nEnter the number you'd like to call\nClick 'Start Masked Phone Call'\nUsing the app: \nClick on Masked Phone on the Dashboard. \nClick 'Make Call' on the bottom right. \nEnter the number you'd like to call\nClick 'Start Masked Call'\nYou will then receive a call on your real phone number from the Masked Phone that will connect you to the number you wanted to call. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#39",
    "html_url": "https://ironvest-kb.groovehq.com/help/create-a-masked-email",
    "title": "Create a Masked Email",
    "body": "From the website: 1. Go to the Emails section on your Dashboard or click here.2. Click on the \"+New Masked Email\" button. 3. Enter the site for which you're using the Masked Email and click \"Create Masked Email\". \nFrom the extension: \n1. Go to the site you want to create the Masked Email for. 2. On the sign-up page, click the email box. 3. Click \"Mask My Email\"Please note that to do this you will need to download the IronVest extension for your browser. \n \nFrom the app:\nClick Masked Email on the Dashboard\nClick '+' on the bottom right. \nEnter the website you'd like to use the Masked Email for. This will help us autofill it for you. \nClick 'Save Masked Email'\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#40",
    "html_url": "https://ironvest-kb.groovehq.com/help/create-a-custom-masked-email",
    "title": "Create a Custom Masked Email ",
    "body": "If a website is rejecting one of our default Masked Emails, you can create a Custom Masked Email for that website. \n \nFrom the website: \nGo to the Emails section on your Dashboard or click here.\nClick on the \"+New Masked Email\" button. \nEnter the site for which you're using the Masked Email\nClick 'Create your customized masked email'\nEnter the prefix and choose the domain you'd like to use from the dropdown. \nClick \"Create Masked Email\". \nFrom the extension: \nGo to the site you want to create the Masked Email for. \nOn the sign-up page, click the email box. \nClick on 'Your custom email' \nClick on the domain to choose a different one\nClick 'fill'Please note that to do this you will need to download the IronVest extension for your browser. \n \nFrom the app:\nClick Masked Email on the Dashboard\nClick '+' on the bottom right. \nEnter the website you'd like to use the Masked Email for. This will help us autofill it for you. \nToggle on 'Customize Your Mask Email'\nEnter the prefix and choose the domain. \nClick 'Save Masked Email'\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#41",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-store-an-existing-account-in-ironvest",
    "title": "How do I store an existing account in IronVest?",
    "body": "Via the Extension: \nLogin to any existing account as you typically would.\nSubmit your account login information to the website.\nYou will see a prompt from IronVest in the top right-hand corner of your screen. Click 'Save this Account' or 'Never for this Site'.\nVia the Website: \nGo to your Dashboard\nClick on Logins & Passwords \nClick '+ New Account'\nEnter the login information for the account you'd like to save. \nClick 'Create Account'.\nOn the app: \nGo to the Account Logins section. \nClick the '+' button on the bottom right\nEnter the login information for the account\nClick 'Save Login'\nThat's it! IronVest has now successfully stored your information and will fill in your account credentials the next time you visit the website. You can view your Account information from the Logins and Passwords section.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#42",
    "html_url": "https://ironvest-kb.groovehq.com/help/using-autofill",
    "title": "Using Autofill",
    "body": "On your computer: \nOnce you install the extension, click the Email or Password field to see the IronVest popup\nFor Credit Card Autofill, you'll click the Credit Card number field to see the IronVest popup\nFor Addresses, click the Street Address field and choose the Address you'd like to fill. \n \nIn Android: \nMake sure the app is open and Autofill has been enabled\nOpen Firefox\nGo to the website. \nClick on the Email or Password field. \nChoose the account you'd like to fill from the list. \n \nIn iOS: \nOpen Safari or an app for which you have an account.\nIf using Safari or another browser, go to a website for which you have an account saved in IronVest.\nTap in the username or password field. \nTap the Passwords prompt on your iOS Keyboard.\nSelect IronVest and authenticate with Touch ID or Face ID\nTap the account for the site or app.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#43",
    "html_url": "https://ironvest-kb.groovehq.com/help/edit-an-account",
    "title": "Edit an Account",
    "body": "\nGo to the Logins & Passwords section\n2. Search for the account you want to Edit\n3. Click the Edit icon under the Edit column\n4. Enter the new details for the account. \n5. Click 'Save Account'\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#44",
    "html_url": "https://ironvest-kb.groovehq.com/help/delete-an-account",
    "title": "Delete an Account",
    "body": "1. Go to the Logins & Passwords section\n2. Search for the account you'd like to delete\n3. Click the trashcan icon next to the Edit button. \n4. Confirm you'd like to delete it. \nNote: At this time, it is not possible to delete multiple accounts at the same time but this is something we are working on. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#45",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-login-to-my-blur-account",
    "title": "How do I login to my Blur account?",
    "body": "You can log in in one of two ways:\nFrom the URL https://ironvest.com/app\nBy clicking the IronVest toolbar icon. Then click \"IronVest\" in the bottom left-hand corner:\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#46",
    "html_url": "https://ironvest-kb.groovehq.com/help/i-forgot-my-blur-password-and-i-do-use-the-account-and-password-management-feature-what-should-i-do",
    "title": "I've forgotten my Blur password, and I DO use the Account & Password Management feature, what should I do?",
    "body": "If you've forgotten your password and you DO have Accounts and Passwords stored, you will need to reset your password using your Backup Passphrase in order to keep all of your account information saved. \nYour Backup Passphrase can be found in Settings of your Dashboard\nClick \"View\" next to Backup Passphrase and this is what you will see:\nWrite your Backup Passphrase down now. If you are not logged into your account, we hope you've written this down in the past.\nOnce you have your Backup Passphrase written down, you can reset your password using this link. That link will take you to a page that asks for your email address. You must then enter the email address that you used to create your account.\nYou'll then receive an email from IronVest, and the subject line of this email will read: \"Reset your IronVest password\". Make sure to click the \"Reset Password\" button that is included in the body of this email message.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#47",
    "html_url": "https://ironvest-kb.groovehq.com/help/ive-forgotten-my-blur-password-and-do-not-use-blur-as-a-password-manager",
    "title": "I've forgotten my Blur password and DO NOT use Blur as a Password Manager",
    "body": " \nIf you've forgotten your password and you DO NOT have Accounts or Passwords stored in IronVest, you can reset your password using this link.\nClicking that link will take you to a page that asks for your email address. You must then enter the email address that you used to create your account.\nYou'll then receive an email from IronVest, and the subject line of this email will read: \"Reset your IronVest password.\". Make sure to click the \"Reset Password\" button that is included in the body of this email message.\nOnce you click the \"Reset Password\" button in that email, you'll then be directed to a page that is asking you for a new Password.\nBecause you DO NOT use IronVest to store your Accounts and Passwords, you DO NOT need to enter your Backup Passphrase on this page.\nResetting your password without your Backup Passphrase will erase any stored Accounts and Passwords in IronVest. \nResetting your password without your Backup Passphrase will NOT erase any Masked Email Addresses, Masked Phone Numbers, or Masked Cards that are stored in IronVest.\nPlease be sure to acknowledge the check box on this page, and notice that the \"Check My Passphrase\" button changes to \"Recovery with Data Loss\" when resetting your account without your Backup Passphrase.\n \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#48",
    "html_url": "https://ironvest-kb.groovehq.com/help/troubleshooting-login-issues-in-the-ironvest-ios-app",
    "title": "Troubleshooting Login Issues in the Ironvest iOS App",
    "body": "Dear IronVest Users,\nWe appreciate your patience and understanding as we work to improve our app. After releasing our latest updates, we understand that some of you may still encounter errors while trying to log into the Ironvest iOS App. We understand how frustrating this can be, but rest assured, we are actively working to address this issue. In the meantime, we’ve outlined a simple solution to help you access your account.\n \nThese steps should work for the following errors:\nLogin required\nRequest failed: unauthorized (401)\n \nClick “Log into a different account?”\nWhen you are at the login page within the app, look for the option that says “Log into a different account?” and tap it. This action will make you log out completely.\nTap \"Log Into Your Account\" and proceed to manually enter your login credentials\nOn the new login screen, manually input your login credentials—your email address and password. Make sure to double-check for any typos or errors.\nLog in as Usual\nOnce you’ve entered your credentials correctly manually, hit the login button. You should now be able to access your account through the app.\n \nShould you continue to experience login issues despite following these steps, please don’t hesitate to reach out to our dedicated support team at support@ironvest.com.\n \nWe acknowledge the frustration these technical glitches bring, but please know we are committed to providing you with the finest user experience.\n \nSincerely,\nThe IronVest Team\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#49",
    "html_url": "https://ironvest-kb.groovehq.com/help/where-can-i-see-messages-sent-to-my-masked-emails",
    "title": "Where can I see messages sent to my Masked Emails?",
    "body": "You can view emails sent to your Masked Email via the temporary inbox: \nGo to the Dashboard\nClick on the envelope icon next to Mobile devices on the top banner. \nYou can also view the emails on your real email address inbox if they have been set to forward. All emails received to a Masked address will be marked \"Masked\" as you can see here:\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#50",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-block-a-sender-from-sending-me-messages-through-one-of-my-masked-emails",
    "title": "How do I block a sender from sending me messages through one of my Masked Emails?",
    "body": "You can block a sender straight from the header on the email itself on your real email address: \nAlso, you can block a sender from the Masked Email section: \nGo to the Dashboard\nClick 'Masked Emails'\nSearch for the Masked Email you'd like to block. \nToggle forwarding off. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#51",
    "html_url": "https://ironvest-kb.groovehq.com/help/can-i-reply-to-a-masked-email",
    "title": " Can I reply to a Masked Email?",
    "body": "Yes! To do so, all you need to do is click the reply button on your real email address just like you would for a regular email. \nWhen you reply to a Masked Email we still keep your real email address private. Do not add new recipients (like CC or BCC) in your replies, or your reply will not be Masked to the new recipients. This is what the address that pops up in the \"To\" field will look like:\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#52",
    "html_url": "https://ironvest-kb.groovehq.com/help/can-i-send-an-email-with-a-masked-email",
    "title": "Can I send an email with a Masked Email?",
    "body": "Yes. To initiate a conversation using a Masked Email, please follow these steps: \nGo to the Masked Email section on your computer, here.\nLook for the Masked Email you'd like to use to send this email.\nClick the Paper Airplane icon under the Action column.\nEnter the email address you'd like to send the email to. Make sure there is no extra space on the field or it will not generate the FWD. \nCopy the email address with FWD that shows up and use it on the \"To\" field when composing the email via your real email address\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#53",
    "html_url": "https://ironvest-kb.groovehq.com/help/is-there-a-limit-to-custom-masked-email-addresses",
    "title": "Is there a limit to custom Masked Email addresses?",
    "body": "Yes. Free users have a limit of 3 Custom Masked Emails but can earn an additional one by successfully reporting when a Masked Email is rejected via the extension.\nIronVest Plus users can create up to 50 Custom Masked Emails and IronVest Ultimate users can create an unlimited number of custom Masked Email addresses.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#54",
    "html_url": "https://ironvest-kb.groovehq.com/help/can-i-generate-a-masked-email-using-my-own-domain",
    "title": "Can I generate a Masked Email using my own domain?",
    "body": "Unfortunately no, you can't generate Masked Emails using your own domain. The Masked Emails we generate for you must all use the domains that are under our ownership in order for us to provide the service to you. \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#55",
    "html_url": "https://ironvest-kb.groovehq.com/help/troubleshooting-masked-email-forwarding-a-comprehensive-guide",
    "title": "Troubleshooting Masked Email Forwarding: A Comprehensive Guide",
    "body": "\nMasked Emails are an excellent tool to protect your privacy. However, you might occasionally encounter issues, such as your Masked Emails not forwarding to your primary email address. Here's a breakdown of possible causes and how to fix them.\n1. Hard Bounces from Masked Email Addresses\nOne potential reason could be that your recent attempts to forward emails via your Masked Email addresses have resulted in \"hard bounces.\" A hard bounce refers to a permanent delivery failure of an email message due to:\nNon-existence of the target email address\nNon-existence of the domain name\nPermanent blockage of email delivery by the recipient's email server\nIn response to hard bounce notifications, we disable forwarding for all of your Masked Emails and prevent the creation of new Masked Emails. This protocol is to keep our bounce rates at a manageable level.\n2. Masked Emails Landing in Spam or Junk Mail\nAnother possibility could be the accidental activation of a spam filter for Masked Emails, causing forwarded Masked Emails to land directly in your spam or junk mail. If this is the case, consider the following steps to rectify the situation:\nAdd the domain \"@opayq.com\" to your \"Safe Senders\" list.\nCreate a filter for \"@opayq.com\" and choose the option that prevents matching email messages from being sent to spam.\nMark any emails with \"[Masked]\" in the \"from\" line as \"Not Spam.\"\nFor detailed instructions tailored to your email provider, refer to the following links:\nOutlook Instructions\nGmail Instructions\nYahoo Instructions\n3. Marking an Email from a Masked Email Address as \"Spam\"\nRemember that marking an email from a Masked Email address as \"spam\" can halt the reception of future Masked Emails. Instead, to stop a Masked Email address from forwarding to your inbox, just block that Masked Email from forwarding. Instructions on how to do this can be found on our FAQs page.\nIn conclusion, understanding these common issues and how to resolve them can help ensure the smooth operation of your Masked Emails and protect your online privacy. If after trying these fixes you still experience issues with your Masked Emails, please do not hesitate to contact our support team at support@ironvest.com. We're here to help!\n \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#56",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-to-add-or-edit-your-forwarding-addresses",
    "title": "How to Add or Edit your Forwarding Addresses",
    "body": "To modify or add your forwarding addresses, please follow these steps:\nGo to the Masked Email section.\nClick the '+ New' button\nSelect 'Add forwarding address'\nThere you can add an address or edit the ones you already have.\nTo save your changes, just enter your password at the bottom and click the 'Save' button.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#57",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-is-ironvest-passcode-protection",
    "title": "What is IronVest Passcode Protection?",
    "body": "IronVest's Passcode Protection is a security feature designed to enhance the protection of your online accounts that have multi-factor authentication (MFA) enabled. MFA requires a code to be sent to your phone via text message for login.\nInstead of having the code sent to your personal phone number, IronVest intercepts the text message and extracts the code, routing it to IronVest, where it can be automatically filled in for you through the use of the browser extension or shown on the mobile app, where you can easily copy and paste it. This added level of security ensures that your sensitive information remains protected.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#58",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-does-ironvest-passcode-protection-work",
    "title": "How does IronVest Passcode Protection work?",
    "body": "By enabling IronVest's Passcode Protection, you can rest assured that the passcodes sent to your masked phone will be intercepted by IronVest and never reach your actual phone number. To take advantage of this feature, simply change the phone number for receiving passcodes in your various online accounts to your IronVest masked phone number.\nThen, when logging into a site, the passcode will be sent to your masked phone number, and IronVest will automatically capture it and fill it in for you if using your browser extension or, if using the mobile app, you can easily copy and paste it in. With IronVest's Passcode Protection, you can enjoy an added level of security and peace of mind while using your online accounts.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#59",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-set-up-ironvest-passcode-protection",
    "title": "How do I set up IronVest Passcode Protection?",
    "body": "To set up IronVest Passcode Protection, first ensure that you have a masked phone and that the Passcode Protection feature is enabled in the Settings. Then, change the phone number for receiving passcodes in your online accounts to your IronVest masked phone number.\nFor a better experience, install the IronVest browser extension or mobile app for seamless passcode retrieval and entry. With the browser extension, passcodes are automatically filled in and with the mobile app, passcodes can be easily copied and pasted.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#60",
    "html_url": "https://ironvest-kb.groovehq.com/help/can-i-use-ironvest-passcode-protection-on-any-site",
    "title": "Can I use IronVest Passcode Protection on any site?",
    "body": "IronVest Passcode Protection can be used on any site that supports Multi Factor Authentication using codes sent to your phone.\nHowever, please note that some websites may not accept masked phone numbers. If you encounter a website that does not support IronVest masked phone numbers, please reach out to our support team at support@ironvest.com for assistance.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#61",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-can-i-use-the-2fa-directory-website-to-help-me-change-the-phone-number-for-receiving-passcodes-in-my-online-accounts",
    "title": "How can I set up my online accounts to be protected with IronVest's passcode protection feature?",
    "body": "How can I use the 2FA directory website to help me change the phone number for receiving passcodes in my online accounts?\n \nHead over to the 2FA directory website at https://2fa.directory and search for the website or service you use.\nCheck if they support SMS or text message-based 2FA. If they do, make a note of your current phone number on that website.\nLogin to your account on that website or service, go to your settings and update your phone number to your IronVest masked number.\nGive it a test run to make sure everything is working smoothly.\nRepeat this process for all the websites or services you use that support 2FA.\nBy using a 2FA directory website, you can easily change the phone number for receiving passcodes and enjoy the added security and convenience that IronVest provides!\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#62",
    "html_url": "https://ironvest-kb.groovehq.com/help/understanding-sim-swap-attacks",
    "title": "Understanding SIM swap attacks",
    "body": "SIM swap attacks occur when someone tricks your cell phone company into switching your phone number to their SIM card. They gather your personal information, often through trickery, data breaches, or purchases on the dark web.\nOnce they control your number, they can receive your calls and texts. This is especially worrisome as many online services, like banking or social media, use text messages for added security, or two-factor authentication (2FA). Attackers can use this access to infiltrate your accounts, change passwords, steal money, or demand a ransom.\nIronVest's Passcode Protection comes to your rescue in such situations. This feature bolsters the security of your accounts that use 2FA. Instead of the 2FA code being sent to your personal number, IronVest intercepts it. After you pass IronVest's biometric verification, the code is then revealed, either being automatically filled in for you through a browser extension or displayed on the mobile app for easy copying and pasting. This security protocol ensures that your sensitive information remains shielded, even in the face of a SIM swap attack.\nRemember to be careful with your personal information, opt for non-text based 2FA when possible, and monitor your accounts regularly. With IronVest's Passcode Protection, you add a powerful shield against SIM swap attacks.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#63",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-is-two-factor-authentication-1",
    "title": "What is Two-Factor Authentication?",
    "body": "To increase the security of your account, you can enable Two-Factor Authentication (2FA). This will require two steps to log in to your account. You will first enter your Password and then you will enter the time-based code that has been generated by the IronVest entry in your Two-Factor Authentication app on your mobile device, at that exact moment.\nTo generate these codes with your mobile device, you can use any Two-Factor Authentication app, like Authy, Google Authenticator, or FreeOTP.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#64",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-login-to-my-account-once-two-factor-authentication-is-authorized",
    "title": "How do I login to my account once Two-Factor Authentication (2FA) is authorized?",
    "body": "\nGo to the login page here.\nEnter your email address and password and click \"Log In\".\nOnce you click login, you will be prompted to enter the authentication code generated by your authentication app.\nFrom your mobile device, open the Two-Factor app, and enter the 6-digit number onto the screen, and click \"Verify\"\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#65",
    "html_url": "https://ironvest-kb.groovehq.com/help/my-6-digit-code-kept-being-rejected-after-entering-my-correct-password",
    "title": " My 6 digit code is rejected after entering password",
    "body": "If you are attempting to enable Two-factor Authentication (2FA) on your account or trying to log in after enabling 2FA, and the authentication code is rejected, this is most often caused by a time sync issue.\nThe Authentication code is time-based and if the time on your Mobile device (or Authentication app) is off by more than 60 seconds, the code you enter will be rejected.\nEach two-factor app will have a unique method for ensuring this time is synced. For example when using Google Authenticator:\nGo to the main menu on the Google Authenticator app\nTap More and then Settings.\nTap Time correction for codes\nTap Sync now\nAuthy on the other hand will sync automatically. \nNote: You can use any Two-Factor Authentication app, like Authy, Google Authenticator, or FreeOTP with IronVest.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#66",
    "html_url": "https://ironvest-kb.groovehq.com/help/i-lost-my-phone-now-i-cant-login-due-to-two-factor-authentication",
    "title": "I lost my phone now I can't login due to Two Factor Authentication.",
    "body": "If you have changed your mobile device, or your Two Factor Authentication (2FA) device has been lost for some reason, you can log in by using email authentication. Once you're logged in, follow these steps to reset the authenticator: \nGo to your Settings page\nClick \"Lost access to my TOTP app. Reset Two-Factor authentication.\"\nCheck your email for instructions. \nAlternatively, you can send us an email to support@ironvest.com for assistance. We will ask you to verify some information on your account before we disable Two Factor Authentication for you.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#67",
    "html_url": "https://ironvest-kb.groovehq.com/help/important-features-you-ll-lose-access-to-when-your-ironvest-trial-expires",
    "title": "Important Features You'll Lose Access to When Your IronVest Trial Expires",
    "body": "IronVest offers a range of security features that come with the trial version of the app. However, users on the free plan (IronVest Essential) will lose access to some of these features once their trial ends.\nThe trial version includes features such as device sync, secure backup, masked card, masked phone, additional masked emails, and priority support. These features help keep users' information safe and secure while using the app.\nOnce the trial period ends and users switch to the IronVest Essential plan, they will no longer have access to these features. To continue using these features and maintain the highest level of protection for their online identity and financial information, users can upgrade their account at any time.\nWe highly recommend upgrading to enjoy all the benefits of IronVest and keep your personal information safe and secure.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#68",
    "html_url": "https://ironvest-kb.groovehq.com/help/why-are-some-tracking-companies-automatically-unblocked",
    "title": "Why are some tracking companies automatically unblocked?",
    "body": "We attempt to block as much tracking as possible without breaking the websites you're visiting. Sometimes when you block all tracking companies, one core functionality of the site will break (such as videos and menus dropdowns). In these situations, we automatically unblock the troublesome company.\nTo block all tracking everywhere, uncheck Use IronVest tracker Suggestions by following the below instructions:\nClick your IronVest browser toolbar icon and select Settings:\nClick \"Settings for All Sites\":\nClick \"More Settings\":\nDeselect \"Use IronVest tracker Suggestions\":\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#69",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-to-do-if-i-still-have-the-old-blur-extension",
    "title": "What to do if I still have the old Blur extension?",
    "body": "If you still have the Blur version of the extension, you may run into issues in autofill. You'll need to install the new version of the extension by following these steps:\nExport your data.\nGo to your Settings page, here \nNavigate to Export Data and Click Export. \nClick Export Data and save the file. \nUninstall your current extension.\nRight-click on the toolbar icon.\nClick Remove extension.\nRestart your browser\nInstall it again depending on your browser\nFirefox.\nChrome\nEdge\nLog in as usual\nPlease note that even though Blur and IronVest are 2 different websites, the login information is the same as they both run under the same system.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#70",
    "html_url": "https://ironvest-kb.groovehq.com/help/do-i-get-charged-after-my-free-trial-is-up",
    "title": "Do I get charged after my free trial is up?",
    "body": "After the first 30 days of your trial, your account will be downgraded from a free trial to a free account.\n You will not be charged once your 30 days are up. You will simply be downgraded to a free account, which means you have access to Masked Emails, the Password & Account Manager (but not synced across devices), and the Tracker Blocker.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#71",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-do-i-uninstall-ironvest",
    "title": "How do I Uninstall IronVest? ",
    "body": "To uninstall Ironvest from your browser, please follow these instructions:Firefox:\nClick the Puzzle icon on your Firefox toolbar\nClick on Extensions\nFind Ironvest on the Extensions list\nClick the 3 horizontal dots\nClick \"Remove\"\nRestart Firefox\nChrome:\nOpen the Chrome Menu\nClick More Tools\nClick Extensions. \nLook for Ironvest on the list\nClick Remove\nRestart Chrome\nEdge: \nClick the Puzzle icon on your Edge toolbar\nFind Ironvest on the Extensions list\nClick the 3 horizontal dots\nClick \"Remove from Microsoft Edge\"\nRestart Edge\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#72",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-distinguishes-your-masked-credit-card-numbers-from-virtual-credit-cards-offered-by-other-banking-providers",
    "title": "What distinguishes your masked credit card numbers from virtual credit cards offered by other banking providers?",
    "body": "On-the-Fly Creation: IronVest's masked cards can be created on the fly using the IronVest browser extension. This offers a seamless user experience, allowing you to generate a masked card in a split second, in the most secure way possible. IronVest's browser extension can also autofill the card details on the checkout form for you.\nBiometric Protection: IronVest offers the option to set up biometric protection on your masked credit cards. This adds a strong layer of security against unauthorized usage, ensuring that only you can access and utilize your IronVest masked cards.\nFunding Source Options: IronVest allows you to fund your masked credit cards using various sources, including credit cards, debit cards, or bank accounts (ACH). This flexibility enables you to choose the funding method that suits you best.\nFee Structure: With IronVest's Ultimate plan, you can enjoy fee-free creation of up to two masked credit cards every 30 days. By linking your funding source to a credit or debit card, you can take advantage of this fee-free feature.\nEnhanced Privacy and Security: IronVest's masked credit cards provide an additional layer of privacy and security during online transactions. By using a masked credit card number, you can protect your actual credit card details and minimize the risk of fraud or data breaches.\nThese advantages highlight the strengths of IronVest's masked credit cards, such as the ability to create them instantly, the option for biometric protection, funding source flexibility, fee-free benefits, and enhanced privacy and security measures.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#73",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-is-the-difference-between-your-masked-email-and-apple-s-hide-my-email",
    "title": "What is the difference between your masked email and Apple's \"hide my email\"?",
    "body": "IronVest's masked email feature offers several advantages over Apple's \"hide my email\" feature:\nExpanded Domain Options: IronVest provides a wider selection of domains for creating masked emails compared to Apple. This allows you to have more options and flexibility in creating unique masked email addresses.\nDisable Forwarding Feature: IronVest offers a unique disable forwarding feature, ensuring that emails received in your masked email address are only accessible within your IronVest inbox. We do not forward these emails to your personal email address, providing an added layer of protection against spam and unwanted communications.\nCustomized Masked Email Addresses: With IronVest's premium plans, such as the Plus and Ultimate plans, you can create customized masked email addresses. This means you can personalize your masked email addresses to suit your preferences or specific needs, enhancing your online privacy and personalization.\nTwo-Month Inbox Storage: IronVest’s premium plans provide a generous two-month inbox storage for your masked email addresses. This allows you to store and manage your emails securely for an extended period, providing convenience and flexibility in accessing and organizing your communications.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#74",
    "html_url": "https://ironvest-kb.groovehq.com/help/understanding-identity-profiles-in-ironvest",
    "title": "Understanding Identity Profiles in IronVest",
    "body": "An Identity Profile in IronVest is a feature within the Identity app that allows users to store personal information and preferences for online form filling. This feature serves as a powerful tool for both convenience and privacy in your digital interactions.\nEach Identity Profile includes data such as your name, address, email, and phone number. More than just a digital storage of your personal information, each Profile also comes with preferences to auto-generate a masked card, a masked email, and a unique password. This happens on the fly when you use your Profile to fill out online forms.\nWhen you're shopping online, signing up for a new service, or providing information for any online interaction, you can choose one of your stored Profiles. IronVest will then auto-fill the form with the data from that Profile. If your Profile's preferences are set to do so, IronVest will also auto-generate a masked card for payment and a unique password and Masked Email for account creation. This means each online interaction can be completed with unique card details, email, and passwords, adding a layer of security to your online activities.\nThis feature is particularly useful if you often use the same sets of information in different online forms. It also allows you to quickly switch between different sets of information, such as personal versus business data. Moreover, the auto-generated masked card, masked email, and unique password provide an additional layer of protection, ensuring your actual information stays private and secure from potential data breaches.\nBy using Identity Profiles in IronVest, you get to enjoy a seamless online experience without compromising your privacy and security. It's a testament to how IronVest is committed to empowering users to navigate the digital world with confidence and ease.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#75",
    "html_url": "https://ironvest-kb.groovehq.com/help/the-ironvest-privacy-app",
    "title": "The IronVest Privacy App",
    "body": "As the digital landscape expands, so too does the importance of safeguarding personal information. The IronVest Privacy App is at the forefront of this effort, providing advanced tools designed to protect your online identity and sensitive details.\nThe IronVest Privacy App works by creating a 'mask' for your personal data when signing up for online services or executing online transactions. It crafts masked information, then reroutes it to your genuine email or phone, securing your personal contact details.\nA key aspect of this app is the Masked Emails feature. It generates anonymous email addresses for you to use instead of your real email when subscribing to a service or website. Importantly, you can set the rules for each Masked Email, choosing to forward incoming emails to your actual email or blocking them to avoid unnecessary spam.\nMeanwhile, the Masked Email Inbox retains all messages sent to your Masked Emails. This means that even if you choose not to forward certain emails to your personal inbox, you won't miss a thing - every email remains accessible in your IronVest inbox. This dual control over incoming emails enhances your privacy and helps keep your personal inbox clutter-free.\nAnother feather in the cap of the IronVest Privacy App is the Masked Phones feature. Like its email counterpart, this feature offers substitute phone numbers for you to use instead of your real number. Calls or texts to the Masked Phone are then forwarded to your actual number, preserving your privacy in the realm of telecommunication. The IronVest Privacy App is a comprehensive solution for preserving your personal information in our interconnected world.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#76",
    "html_url": "https://ironvest-kb.groovehq.com/help/why-ironvest-biometrics-is-key-to-your-online-security-and-experience",
    "title": "Why IronVest Biometrics Is Key to Your Online Security and Experience",
    "body": "When it comes to the online world, your security and ease of use are crucial. That's where IronVest Biometrics comes into play.\nWithout Biometrics, if someone gets their hands on your device, they might be able to log into your online accounts. It's like leaving your house keys under the doormat - anyone who knows where to look can get in.\nBy turning on IronVest Biometrics, you use your unique face - something no one else can copy - to make sure only you can access your accounts. It's a powerful tool to stop others from logging into websites as you, seeing your sensitive data, or making changes to your accounts.\nAnd it's not just about keeping your information safe. IronVest Biometrics also makes things easier for you. Remembering and typing in your master password every time you need to autofill a password can be a hassle. But with Biometrics, a quick facial scan does the job. It's faster, simpler, and more convenient.\nIn short, enabling Biometrics on the IronVest extension provides an extra layer of security and a better user experience. It keeps your online world safer and makes your online journey smoother. It's a small change that can make a big difference.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#77",
    "html_url": "https://ironvest-kb.groovehq.com/help/extension-9-8-0-release-sep-10-2023",
    "title": "Extension 9.8.0 Release - Sep 10, 2023",
    "body": "Features:\nAccount Auto-Save Pop-Up:\nWHAT: Engage with a proactive pop-up every time an unrecognized account gets stored. Decide if you want to keep the details or simply UNDO.\nWHY: We believe in transparency and control. We ensure you're always in the loop, and your choices are paramount.\nHOW: Experience it in action after logging into new domains. To alter this behavior, navigate to Settings Panel > Settings > Account Saving.\nBiometric Verification for Individual Accounts:\nWHAT: Personalize your security! Now choose which accounts warrant biometric verification for heightened protection.\nWHY: Every account has its significance. Some may contain sensitive data, while others for leisurely browsing. We acknowledge your discretion.\nHOW: After your first successful biometric login, a pop-up will allow you to modify biometric settings. Additionally, you can adjust this setting directly on the account record in the web-app.\nIn-Extension Issue Reporting System:\nWHAT: Discovered an anomaly? Report directly from the extension, ensuring we refine the tool based on your observations.\nWHY: Your insights are invaluable. This feature ensures we evolve in the right direction.\nHOW: Simply tap on the bug icon within the extension.\n \nEnhancements:\nOptimized Masked Cards Autofill Logic for Checkout Forms:\nWHAT: Every card at your disposal. Those stored outside the extension now make an appearance, ensuring a seamless checkout experience.\nWHY: Manually entering details can be a hassle. Our enhanced logic guarantees every saved card is within reach.\nHOW: Experience the automation in the refreshed version. Just be on a checkout page, and IronVest takes over.\nBug Fixes:\nExtension Menu Truncation:\nAddressed truncation issues for a smooth user experience.\nPassword Update Glitch:\nRectified the anomaly that previously left the password update menu empty.\nRedundant Prefix Removal:\nSay goodbye to unnecessary clutter. Autofill is now cleaner, devoid of the \"Fill Account:\" prefix.\nYour feedback has been paramount in shaping these updates. We thank you for your trust in IronVest and look forward to further refining our offerings based on your insights.\n \n \n \n \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#78",
    "html_url": "https://ironvest-kb.groovehq.com/help/webapp-release-aug-8th-2023",
    "title": "Webapp Release - Aug 8th, 2023",
    "body": "New Beta View for the Privacy App\nIn this significant revamp to the Privacy app, we've refreshed the user interface to make it more intuitive and visually appealing. The Masked Email and Masked Phone tabs have a modern and user-friendly design, ensuring that you can easily mask your real email and phone number to protect against spam. We've also overhauled the IronVest Inbox page, giving it a sleeker appearance. This new design aligns with our commitment to providing a seamless user experience, making navigation and interaction within the inbox more pleasant and efficient. Transitioning between the Access Guard, Pay App, and Identity App is now more streamlined as well. Just switch on the redesigned features in the app, and the corresponding views switch automatically, making the change smooth and hassle-free.\n \n \nMore Features\nPay App Update - Inline Address Creation: When creating a new auto-fill credit card in the pay app, you can now directly add a new address, simplifying the process and saving time.\nPay App Update - Better Card Verification Process: A new button in the pay app's credit card verification process makes adding a funding source simpler and more intuitive, enhancing your overall experience as you set up masked cards.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#79",
    "html_url": "https://ironvest-kb.groovehq.com/help/webapp-release-july-12th-2023",
    "title": "Webapp Release - July 12th, 2023",
    "body": "Introducing the New Beta View for Identity App\nWe are proud to announce the long-anticipated release of the beta version of our Identity app. With this update, we have introduced Identity Profiles and Addresses tabs, giving users more control and efficiency in managing their online identities. This fresh view includes a sleek modern design that not only elevates user experience but also strengthens app security and boosts performance.\nTo access the beta version, users can toggle on the Auto-fill Identities and/or Auto-fill Addresses from their existing profile pages. To ensure a smooth transition, the Access Guard and Pay App beta views will synchronize with the same toggle action, delivering a seamless transition and an improved user interface experience.\nImproved Stability and Fixes\nIn our commitment to provide the best user experience, we have addressed critical issues and implemented improvements:\nFixed an issue that was causing invalid zip code errors for users in Germany when filling out the payment form. This issue is now resolved, and users can complete payment forms without encountering these errors.\nCorrected a redirection problem where users were being redirected to the dashboard page when attempting to reactivate biometric protection. Now, when you disable and then re-enable biometric protection, you'll be directed to the appropriate biometrics activation page.\nWe have significantly improved the stability and robustness of our biometric infrastructure to ensure reliable and secure user authentication.\nWe're excited about these improvements and are always eager to hear your feedback as we continue to improve and enhance your experience with our web application.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#80",
    "html_url": "https://ironvest-kb.groovehq.com/help/extension-release-july-6",
    "title": "Extension Release - July 6",
    "body": "\nImprovements:\nAccessGuard Password Enhancement:\nWe've revamped our AccessGuard Password extension for a more user-friendly experience, particularly for partial account holders. Instead of asterisks, the panel will now show \"Username Missing\", which is clickable to autofill the saved password.\nA 'fix' icon has been introduced that opens the account record in edit mode in a new tab, allowing rapid correction of incomplete information.\nWe've simplified the autofill instruction to \"Fill Password\", replacing the previous \"Fill Strong Password\" text. This update applies across all accounts.\nPasscode Protection Update:\nWe've optimized the OTP (One-Time Password) entry procedure as part of our passcode protection feature. After user authentication, the OTP will automatically populate in the designated field, eliminating the need for manual input via the \"fill code\" button.\nIn the event of an unsuccessful auto-fill, the \"Copy\" and \"Fill\" buttons will remain available for manual entry.\nBug Fixes:\nBiometric Verification Bug:\nWe've addressed an issue where disabling the biometric verification on card creation setting was not applying as expected.\nMinor Bugs:\nIn addition to the main bug fix, we've made several other minor bug fixes to improve performance and stability.\nWe encourage you to update to version 9.7.0 to take advantage of these improvements. As always, we appreciate your feedback and are committed to continuous improvement based on your needs.\n \n \n \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#81",
    "html_url": "https://ironvest-kb.groovehq.com/help/extension-release-may-11th-2023",
    "title": "Extension Release - May 11th, 2023",
    "body": "New Features\nAdded the ability to perform biometric verification on masked card creation and physical cards autofill for enhanced protection.\nTo enable masked card protection you need to:\nEnable \"Biometric Protection\" in the Webapp settings\nEnable \"Card Biometric Protection\" in the extension settings\n \n \n \n \n \n \n \n \n \n \nWe have introduced biometric authentication fallbacks that will be triggered in case of biometric verification failure. These fallback screens will appear after two consecutive biometric verification failures.\nAdded trial expiration indicators in the different extension panels\nBiometric verification will only be required after a period of time passed since the last successful authentication.\nAdded premium and help buttons in the mini-dashboard panel’s footer.\nSecurity improvements.\nBug Fixes\nFixed an issue in which trying to ignore a form using the mapping panel will require the user to also select the ignore option on each one of the form fields.\nFixed an issue in which passcode protection would sometimes fail to show the passcode when authenticating using master password.\nFixed an issue in which when failing to login to a certain website, the extension would sometimes offer you to save the password anyways.\nFixed link redirection issues in some panels.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#82",
    "html_url": "https://ironvest-kb.groovehq.com/help/webapp-release-may-8th-2023",
    "title": "Webapp Release - May 8th, 2023",
    "body": "Beta View for Pay App\nOur latest release brings a highly anticipated beta view to our Pay app. The Real Cards tab allows users to manage their autofill wallet, while the Masked Cards tab lets them create virtual cards that protect their privacy and ensure secure payments. With a fresh and modern look, this beta view enhances the app's security and performance. Users can easily access this beta view by toggling on the Credit Cards and/or the Virtual Cards legacy pages. Additionally, the Access Guard beta view also switches automatically with the same toggle, making the transition seamless.\n \nBugs fixes\nWe fixed the issue preventing users from entering postal codes on our Funding Source page. Users can now set up their masked cards feature without any trouble and provide their postal codes in their local format.\nThe issue affecting the \"Forward this email again\" button for masked emails has been resolved. Users can now forward their masked emails to their personal inbox without any issues.\n \n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#83",
    "html_url": "https://ironvest-kb.groovehq.com/help/mobile-release-may-4th-2023",
    "title": "Mobile Release - May 4th, 2023",
    "body": "Introducing our latest release versions 9.1.1 on iOS and Android! This update brings new server updates that enhance key functions such as email verification, sign up, and login. These changes will improve performance and development time, resulting in an enhanced user experience and faster time-to-market for future feature releases. In addition, this release includes various performance updates that will improve the speed and quality of our product for our users. Try out this latest version today and enjoy a better experience!\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#84",
    "html_url": "https://ironvest-kb.groovehq.com/help/webapp-release-april-24-2023",
    "title": "Webapp Release - April 24th, 2023",
    "body": " \nImproved Performance: We have made significant improvements to our platform's performance, resulting in faster load times and smoother user experience.\nImport Support for Non-Sync Users: We understand that not all users utilize our sync feature, so we have added support for importing data from external sources for non-sync users.\nIronVest Export File Support: We have added the ability to import your data in the IronVest format, allowing for greater flexibility in managing your sensitive information.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#85",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-is-ironvest-s-backup-sync-feature",
    "title": "What is IronVest's Backup & Sync Feature?",
    "body": "Backup & Sync is a premium feature offered by IronVest, designed to optimize your Autofill data management. It provides security for your data and ensures it's readily available across different devices. This feature encompasses Login and Password details, Autofill cards (excluding Masked Cards), Identity Profiles, and Addresses. Exclusive to premium users, it serves as a comprehensive data management solution.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#86",
    "html_url": "https://ironvest-kb.groovehq.com/help/can-i-enable-either-backup-or-sync-in-ironvest",
    "title": "Can I Enable Either Backup or Sync in IronVest?",
    "body": "Backup & Sync is a fused feature in IronVest — you cannot enable just one part of it. They are either both enabled or both disabled. This configuration provides a well-rounded data security and accessibility solution. By having these features interlinked, IronVest ensures comprehensive data protection and availability.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#87",
    "html_url": "https://ironvest-kb.groovehq.com/help/is-backup-sync-available-during-ironvest-s-trial-period",
    "title": "Is Backup & Sync Available During IronVest's Trial Period?",
    "body": "Backup & Sync is available during the trial period of IronVest. However, it's not available for users on the Free Plans once the trial period ends. To continue enjoying the Backup & Sync feature, users need to upgrade to a premium plan.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#88",
    "html_url": "https://ironvest-kb.groovehq.com/help/how-does-backup-sync-affect-my-autofill-data-in-ironvest",
    "title": "How Does Backup & Sync Affect My Autofill Data in IronVest?",
    "body": "The Backup & Sync feature plays a crucial role in managing your Autofill data in IronVest. When enabled, your Autofill data, which includes Login details, passwords, Autofill cards, Identity Profiles, and Addresses, is accessible across various devices and browsers, making for a seamless user experience. However, without Backup & Sync, your Autofill data is stored locally on the browser where it was created and won't be available on a different device or browser.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#89",
    "html_url": "https://ironvest-kb.groovehq.com/help/what-happens-if-i-lose-my-device-or-it-gets-stolen",
    "title": "What Happens If I Lose My Device or It Gets Stolen?",
    "body": "If you lose your device or it gets stolen, IronVest's Backup & Sync feature comes to the rescue. If it was enabled, IronVest can restore your Autofill data in case of such loss. However, without Backup & Sync enabled, IronVest cannot restore your Autofill data as it does not store any backups on our servers.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#90",
    "html_url": "https://ironvest-kb.groovehq.com/help/if-you-lose-your-device-or-it-gets-stolen-ironvest-s-backup-sync-feature-comes-to-the-rescue-if-it-was-enabled-ironvest-can-restore-your-autofill-data-in-case-of-such-loss-however-without-backup-sync-enabled-ironvest-cannot-restore-your-autofill-data-as-i",
    "title": "What About My Masked Data in IronVest?",
    "body": "Regardless of whether Backup & Sync is enabled, you always have access to your Masked Cards, Masked Emails, and Masked Phones. These data points are not considered Autofill data but are saved with IronVest, ensuring their availability at all times.\n            ",
    "strictMatch": true
  },
  {
    "id": "ironvest-kb.groovehq.com#91",
    "html_url": "https://ironvest-kb.groovehq.com/help/is-my-data-safe-with-ironvest",
    "title": "Is My Data Safe with IronVest?",
    "body": "Your Autofill data records are encrypted with your private key, and only you can decrypt them. This assures that even IronVest cannot decrypt these records, ensuring the highest level of privacy and security for your data.\n            ",
    "strictMatch": true
  }
]